[{"NAME": "       icewm - un gestor de ventanas pequeño y rápido\n\n", "SINÓPSIS": "       icewm [-display DISPLAY] [-c CONFIG] [-n] [-debug]\n\n", "DESCRIPCION": "       Esta  página de manual describe brevemente el gestor de ventanas IceWM.  Esta página ha sido escrita para\n       la distribución GNU/Linux Debian (pero puede ser usada por otros), porque el programa original  no  tenía\n       ninguna.  En cambio sí hay documentación en formato HTML; ver más adelante.\n\n       La  finalidad  de  IceWM  es  tener  un  pequeño, rápido y familiar gestor de ventanas para el sistema de\n       ventanas X11. Se desea la compatibilidad con el gestor de ventanas mwm,  para  lo  cual  se  implementará\n       aquello que sea necesario.\n\n       El  IceWM  está diseñado para emular la apariencia de Motif, OS/2 Warp 4, OS/2 Warp 3 y Windows 95. Puede\n       que se añadan otros en el futuro.\n\n       También intenta combinar el entorno de esos sistemas en los casos en que esto sea posible.\n\n       Generalmente intenta tener todas sus funciones disponibles tanto por teclado como  por  ratón  (  por  el\n       momento esto no es posible cuando se usa la activación mediante ratón).\n\n       IceWM  NO persigue llegar a la extrema configurabilidad que tienen gestores de ventanas como fvwm y otros\n       muchos.\n\n", "OPCIONES": "       -display DISPLAY\n              Fijar DISPLAY como display.\n\n       -c CONFIG\n              Usar CONFIG como archivo de configuración.\n\n       -n     No usar archivo de configuración.\n\n       -debug Escribir varia información de debug en stderr.\n\nVÉASE TAMBIÉN\n       La documentación original puede encontrarse en /usr/doc/icewm/ en formatos HTML y SGML, o puede obtenerse\n       mediante el sistema dwww si está instalado.\n\n", "AUTOR": "       Esta  página  de  manual  ha  sido  escrita  por  Gergely Madarasz <gorgo@caesar.elte.hu> para el sistema\n       GNU/Linux Debian.\n\n                                                                                                        ICEWM(1)\n"}]