[{"NOMBRE": "       console - terminal de consola y consolas virtuales.\n\n", "DESCRIPCIÓN": "       Un sistema Linux tiene hasta 63 consolas virtuales (dispositivos de carácter de número mayor 4 y menor de\n       1 a 63), denominadas habitualmente /dev/ttyn donde 1 ≤ n ≤ 63.  La consola actual se designa también  por\n       /dev/console  o  /dev/tty0,  el  dispositivo  de  carácter con número mayor 4 y menor 0.  Los ficheros de\n       dispositivo /dev/* se crean normalmente con el guión MAKEDEV o con mknod(1), habitualmente  con  el  modo\n       0622 y propietario/grupo root.tty.\n\n       Anteriormente  a  la versión 1.1.54 del núcleo, el número de consolas virtuales se compilaba en el propio\n       núcleo (en tty.h: #define NR_CONSOLES 8) y sólo se podía cambiar editando y recompilando. A partir de  la\n       versión 1.1.54, las consolas virtuales se crean sobre la marcha, en el momento en que se necesiten.\n\n       Las  formas habituales de arrancar un proceso en una consola son: (a) decir a init(8) (en inittab(5)) que\n       arranque un getty(8) en la consola; (b) pedir a open(1) que  arranque  un  proceso  en  la  consola;  (c)\n       arrancar  X,  que  buscará la primera consola libre y visualizará allí su salida.  (También está el viejo\n       doshell(8).)\n\n       Para conmutar de consola podemos: (a) teclear Alt+Fn o Ctrl+Alt+Fn para conmutar a la consola n; AltGr+Fn\n       puede  llevarnos  a  la  consola  n+12 [aquí Alt y AltGr se refieren a las teclas Alt izquierda y derecha\n       respectivamente]; (b) usar Alt+CursorDerecha o Alt+CursorIzquierda para hacer un ciclo a  través  de  las\n       consolas  en  uso;  (c)  usar  el  programa  chvt(1).  (Las combinaciones de teclas son definibles por el\n       usuario, véase loadkeys(1).  Las combinaciones mencionadas arriba son los valores por omisión).\n\n       El programa deallocvt(1) (anteriormente disalloc)  libera  la  memoria  reservada  por  los  tampones  de\n       pantalla de aquellas consolas que no tengan ningún proceso asociado.\n\n", "PROPIEDADES": "       Las  consolas  conllevan  un montón de estado. Espero documentarlo alguna vez. El hecho más importante es\n       que las consolas simulan terminales vt100. En particular, si se imprimen dos caracteres ESC c, la consola\n       vuelve a su estado inicial. Todas las secuencias de escape se pueden encontrar en console_codes(4).\n\n", "FICHEROS": "       /dev/console\n       /dev/tty*\n\nVÉASE TAMBIÉN\n       chvt(1),  deallocvt(1),  loadkeys(1),  mknod(1),  open(1),  console_codes(4),  console_ioctl(4),  tty(4),\n       ttys(4), charsets(7), getty(8), init(8), mapscrn(8) resizecons(8), setfont(8)\n\nLinux                                             30 junio 1996                                       CONSOLE(4)\n"},{"NOMBRE": "       console_codes - secuencias de escape y control de la consola de Linux\n\n", "DESCRIPCIÓN": "       La  consola  de  Linux  implementa  un  vasto  subconjunto de los controles de terminal de la VT102 y del\n       estándar ECMA-48/ISO 6429/ANSI X3.64, más ciertas secuencias de modo privadas para cambiar la  paleta  de\n       colores,  asociaciones  de  conjuntos de caracteres, etc.  En las descripciones tabulares de abajo, la 2ª\n       columna da los mnemónicos ECMA-48 o DEC (éstos, prefijados por DEC) para la función dada.  Las secuencias\n       sin un mnemónico no son ni ECMA-48 ni VT102.\n\n       Después  de  haber hecho todo el procesamiento de salida normal, y de que un flujo de caracteres llega al\n       controlador de consola para la impresión de verdad, la 1ª cosa que ocurre es una  traducción  del  código\n       empleado para el procesamiento al código empleado para la impresión.\n\n       Si  la consola está en el modo UTF-8, entonces los bytes que llegan se ensamblan 1º a los códigos de 16 b\n       Unicode. Si no, cada byte se transforma según la tabla de asociaciones en curso  (que  lo  traduce  a  un\n       valor Unicode). Vea más abajo la sección CONJUNTOS DE CARACTERES para la discusión sobre esto.\n\n       En  el  caso  normal,  el  valor Unicode se convierte a un índice de tipo de letra, y éste se almacena en\n       memoria de vídeo, de forma que aparezca en la pantalla el grafo correspondiente (según se encuentra en la\n       ROM  de  vídeo).  Observe que el empleo de Unicode (y el diseño del hardware del PC) nos permite usar 512\n       grafos diferentes simultáneamente.\n\n       Si el valor actual Unicode es un carácter de control, o estamos actualmente procesando una  secuencia  de\n       escape,  el  valor se tratará especialmente. En vez de convertirse a un índice de tipo y presentarse como\n       un grafismo, puede lanzar un movimiento del cursor u otra función de control.  Vea la  sección  CONTROLES\n       DE LA CONSOLA DE LINUX abajo para la discusión sobre esto.\n\n       Generalmente  no es una buena idea codificar directamente controles de terminal en programas. Linux tiene\n       una base de datos terminfo(5) de capacidades de terminales.  En vez de emitir a mano secuencias de escape\n       de la consola, Ud. debería casi siempre utilizar una biblioteca de pantalla que consultara terminfo o una\n       utilidad, como ncurses(3), tput(1), o reset(1).\n\nCONTROLES DE LA CONSOLA DE LINUX\n       Esta sección describe todos los caracteres de control y secuencias  de  escape  que  llaman  a  funciones\n       especiales  (i.e.,  cualquier  otra  cosa  distinta  a escribir un grafo en la localización del cursor en\n       curso) en la consola de Linux.\n\n   Caracteres de control\n       Un carácter lo es de control si (antes de la transformación según la tabla de asociaciones) tiene uno  de\n       los  14  códigos  00  (NUL),  07 (BEL), 08 (BS), 09 (HT), 0a (LF), 0b (VT), 0c (FF), 0d (CR), 0e (SO), 0f\n       (SI), 18 (CAN), 1a (SUB), 1b (ESC), 7f (DEL).  Uno puede establecer un modo  de  `mostrar  caracteres  de\n       control' (vea más abajo), y permitir que los códigos 07, 09, 0b, 18, 1a, 7f se muestren como grafos.  Por\n       otro lado, en modo UTF-8 todos los códigos 00-1f se miran como caracteres de control, sin importar ningún\n       modo `mostrar caracteres de control'.\n\n       Si  tenemos  un carácter de control, se actúa inmediatamente y luego se descarta (incluso en medio de una\n       secuencia de escape) y la secuencia de escape continúa con el  siguiente  carácter.   (Sin  embargo,  ESC\n       empieza  una  nueva  secuencia  de  escape,  posiblemente  abortando una anterior no acabada, y CAN y SUB\n       abortan cualquier secuencia de escape).  Los caracteres de control reconocidos son BEL, BS, HT,  LF,  VT,\n       FF, CR, SO, SI, CAN, SUB, ESC, DEL, CSI. Hacen lo que uno esperaría:\n\n       BEL (0x07, ^G) pita;\n\n       BS (0x08, ^H) va un espacio atrás a la columna anterior (pero no pasa del principio de la línea);\n\n       HT (0x09, ^I) va a la siguiente parada de tabulación o al final de la línea si no hay antes una parada de\n              tabulación;\n\n       LF (0x0A, ^J), VT (0x0B, ^K) y FF (0x0C, ^L) todos dan un salto de línea;\n\n       CR (0x0D, ^M) da un retorno de carro;\n\n       SO (0x0E, ^N) activa el conjunto de caracteres G1, y si  está  activado  LF/NL  (modo  de  nueva  línea),\n              también un retorno de carro;\n\n       SI (0x0F, ^O) activa el conjunto de carcteres G0;\n\n       CAN (0x18, ^X) y SUB (0x1A, ^Z) interrumpen secuencias de escape;\n\n       ESC (0x1B, ^[) empieza una secuencia de escape;\n\n       DEL (0x7F) no es tenido en cuenta;\n\n       CSI (0x9B) es equivalente a ESC [.\n\n   Secuencias de ESC, pero no CSI\n       ESC c     RIS      Inicio.\n       ESC D     IND      Salto de línea.\n       ESC E     NEL      Nueva línea.\n       ESC H     HTS      Pone parada tab en esta columna.\n       ESC M     RI       Salto de línea inverso.\n       ESC Z     DECID    DEC identificación privada. El núcleo\n                          devuelve la cadena ESC [ ? 6 c, diciendo\n                          que es una VT102.\n       ESC 7     DECSC    Salva el estado actual (cordenadas del cursor,\n                          atributos, conjuntos de caracteres apuntados por G0, G1).\n       ESC 8     DECRC    Restaura el estado salvado más reciente por ESC 7.\n       ESC [     CSI      Introductor de secuencia de control\n       ESC %              Empieza la secuencia de selección de conjunto de caracteres\n       ESC % @               Selecciona el predeterminado (ISO 646 / ISO 8859-1)\n       ESC % G               Selecciona UTF-8\n       ESC % 8               Selecciona UTF-8 (obsoleto)\n       ESC # 8   DECALN   DEC prueba de alineación en pantalla - la llena de E's.\n       ESC (              Empieza secuencia de definición del conjunto G0\n       ESC ( B               Selecciona predeterminado (asociación ISO 8859-1)\n       ESC ( 0               Selecciona asociación de gráficos vt100\n       ESC ( U               Selecciona ninguna asociación - derecho a la ROM\n       ESC ( K               Selecciona asociación del usuario - la que se carga con\n                             la utilidad mapscrn(8).\n       ESC )              Empieza la secuencia de definición de G1\n                          (seguido por uno de B, 0, U, K, como arriba).\n       ESC >     DECPNM   Pone el teclado auxiliar en modo numérico\n       ESC =     DECPAM   Pone el teclado auxiliar en modo aplicación\n       ESC ]     OSC      (Debería ser: Orden del sistema operativo)\n                          ESC ] P nrrggbb: pone paleta, con parámetro\n                          dado en 7 dígitos hexadecimales tras la P final :-(.\n                          Aquí n es el color (0-15), y rrggbb indica\n                          los valores rojo/verde/azul (0-255).\n                          ESC ] R: restaura paleta\n\n   Secuencias ECMA-48 CSI\n       CSI  (o  ESC  [)  es  seguido  por una secuencia de parámetros, como mucho NPAR (16), que son los números\n       decimales separados por punto y comas. Un parámetro vacío o ausente se toma  como  0.   La  secuencia  de\n       parámetros puede ir precedida por un signo de interrogación.\n\n       Sin  embargo,  tras  CSI  [  (o  ESC [ [) se lee un carácter solo y esta secuencia entera no es tenida en\n       cuenta. (La idea es no hacer caso de una tecla de función que se muestra.)\n\n       La acción de una secuencia CSI se determina por su carácter final.\n\n       @   ICH       Insertar el Nº indicado de caracteres blancos\n       A   CUU       Mover cursor arriba el Nº indicado de filas\n       B   CUD       Mover cursor abajo el Nº indicado de filas\n       C   CUF       Mover cursor a la derecha el Nº indicado de columnas\n\n       D   CUB       Mover cursor a la izquierda el Nº indicado de columnas\n       E   CNL       Mover cursor abajo el Nº indicado de filas, a la columna 1\n       F   CPL       Mover cursor arriba el Nº indicado de filas, a la columna 1\n       G   CHA       Mover cursor a la columna indicada en la fila actual\n       H   CUP       Mover cursor a la fila y columna indicadas (origen en 1,1)\n       J   ED        Borrar pantalla (p. o.: desde el cursor al final de la pantalla).\n                     ESC [ 1 J: borrar desde el comienzo hasta el cursor.\n                     ESC [ 2 J: borrar la pantalla entera.\n       K   EL        Borrar línea (p.o.: desde el cursor al final de la línea).\n                     ESC [ 1 K: borrar desde el comienzo de la línea al cursor\n                     ESC [ 2 K: borrar la línea entera.\n       L   IL        Insertar el Nº indicado de líneas en blanco\n       M   DL        Borrar el Nº indicado de líneas\n       P   DCH       Borrar el Nº indicado de caracteres en la línea actual\n       X   ECH       Borrar el Nº indicado de caracteres en la línea actual\n       a   HPR       Mover cursor a la derecha el Nº indicado de columnas\n       c   DA        Reponder ESC [ ? 6 c: `Yo soy una VT102'.\n       d   VPA       Mover cursor a la fila y columna indicadas\n       e   VPR       Mover cursor abajo el Nº indicado de filas\n       f   HVP       Mover cursor a la fila y columna indicadas\n       g   TBC       Sin parámetro: quita parada TAB en la posición actual\n                     ESC [ 3 g: borra todas las paradas de tabulación\n       h   SM        Establece Modo (vea abajo).\n       l   RM        Restablece Modo (vea abajo).\n       m   SGR       Establece atributos (vea abajo).\n       n   DSR       Informe de estado (vea abajo).\n       q   DECLL     Establece los LEDs del teclado.\n                     ESC [ 0 q: apaga todos los LEDs\n                     ESC [ 1 q: pone LED Bloq. Despl.\n                     ESC [ 2 q: pone LED Bloq. Num.\n                     ESC [ 3 q: pone LED Bloq. Mayús.\n       r   DECSTBM   Establece región de rodadura; los parámetros son la fila de arriba y abajo\n       s   ?         Salva la localización del cursor\n       u   ?         Restaura la localización del cursor.\n       `   HPA       Mover cursor a la columna indicada en la fila indicada\n\n   ECMA-48 Pone modo Gráfico\n       La secuencia ECMA-48 SGR  ESC [ <parámetros> m establece los atributos de la pantalla.  Se  pueden  poner\n       varios atributos en la misma secuencia.\n\n       par   resultado\n       0     restablece todos los atributos a sus valores predeterminados\n       1     pone negrillas\n       2     pone medio brillo (simulado con color en una pantalla a color)\n       4     pone subrayado (simulado con color en una pantalla a color)\n             (los colores para simular disminución o subrayado se ponen con\n             ESC ] ...)\n       5     pone intermitencia\n       7     pone vídeo inverso\n       10    restaura asociación seleccionada, indicador de control de\n             pantalla y cambia el indicador meta\n       11    selecciona no asociación, pone indicador de control de\n             pantalla, restaura indicador de cambio meta\n       12    selecciona no asociación, pone indicador de control de\n             pantalla, pone indicador de cambio meta (que hace que el bit\n             más alto de un byte cambie antes de que se haga la traducción\n             de la tabla de asociación.)\n       21    pone intensidad normal (esto no es compatible con ECMA-48)\n       22    pone intensidad normal\n       24    quita subrayado\n       25    quita intermitencia\n       27    quita vídeo inverso\n       30    pone negro\n       31    pone rojo\n       32    pone verde\n\n       33    pone marrón\n       34    pone azul\n       35    pone rosa\n       36    pone celeste\n       37    pone blanco\n       38    pone subrayado, color predeterminado\n       39    quita subrayado, pone color predeterminado\n       40    pone negro de fondo\n       41    pone rojo de fondo\n       42    pone verde de fondo\n       43    pone marrón de fondo\n       44    pone azul de fondo\n       45    pone rosa de fondo\n       46    pone celeste de fondo\n       47    pone blanco de fondo\n       49    pone el color de fondo predeterminado\n\n   Interruptores de Modo ECMA-48\n       ESC [ 3 h\n              DECCRM (por omisión desactivado): Mostrar caracteres de control\n\n       ESC [ 4 h\n              DECIM (por omisión desactivado): Poner modo de inserción\n\n       ESC [ 20 h\n              LF/NL (por omisión desactivado): Automáticamente seguir a LF, VT o FF con CR.\n\n   Órdenes de Informe de Estado ECMA-48\n       ESC [ 5 n\n              Informe de estado de dispositivo (DSR): La respuesta es ESC [ 0 n (Terminal OK).\n\n       ESC [ 6 n\n              Informe  de  posición de cursor (CPR): La respuesta es ESC [ y ; x R, donde x,y es la localización\n              del cursor.\n\n   Secuencias de Modo Privado DEC (DECSET/DECRST).\n       Éstas no se describen en ECMA-48. Listamos las secuencias de Establecer Modo; las de Reestablecer Modo se\n       obtienen reemplazando la hache final por ele.\n\n       ESC [ ? 1 h\n              DECCKM  (por  omisisón  desactivado): Cuando está activado, las teclas de cursor envían un prefijo\n              ESC O, en vez de ESC [.\n\n       ESC [ ? 3 h\n              DECCOLM (por omisión desactivado = 80 columnas): interruptor de  modo  80/132  columnas.   En  los\n              fuentes  del  controlador  se  hace  notar que esto solo no basta; alguna utilidad de usuario como\n              resizecons(8) tiene que cambiar los registros de hardware en la tarjeta de vídeo de consola.\n\n       ESC [ ? 5 h\n              DECSCNM (por omisión desactivado): Pone el modo de vídeo inverso\n\n       ESC [ ? 6 h\n              DECOM (por omisión desactivado): Cuando está activado, el direccionamiento del cursor es  relativo\n              a la esquina superior izquierda de la región de rodadura.\n\n       ESC [ ? 7 h\n              DECAWM  (por  omisión  activado):  Activa el paso automático de renglón. En este modo, un carácter\n              gráfico emitido tras la columna 80 (o la 132  si  está  activado  DECCOLM)  fuerza  un  cambio  al\n              principio de la siguiente línea.\n\n       ESC [ ? 8 h\n              DECARM (por omisión activado): Activa la auto-repetición del teclado\n\n       ESC [ ? 9 h\n              Informe  de Ratón X10 (por omisión desactivado): Establece el modo de informe a 1 (o lo restaura a\n              0) - vea abajo.\n\n       ESC [ ? 25 h\n              DECCM (por omisión activado): Hace visible el cursor.\n\n       ESC [ ? 1000 h\n              Informe de Ratón X11 (por omisión desactivado): Establece el modo de informe a 2 (o lo restaura  a\n              0) - vea abajo.\n\n   Secuencias Privadas de Consola de Linux CSI\n       Las  siguientes  secuencias  no son ni ECMA-48 ni VT102 nativas. Son nativas al controlador de consola de\n       Linux. Los colores están en los parámetros SGR: 0 = negro, 1 = rojo, 2 = verde, 3 = marrón, 4 = azul, 5 =\n       rosa, 6 = celeste, 7 = blanco.\n\n       ESC [ 1 ; n ]       Pone el color n como el de subrayado\n       ESC [ 2 ; n ]       Pone el color n como el disminuido\n       ESC [ 8 ]           Hace al color actual el de los atributos predeterminados\n       ESC [ 9 ; n ]       Pone el tiempo de espera del blanqueado de la terminal a n min.\n       ESC [ 10 ; n ]      Establece la frecuencia del pito en Hz.\n       ESC [ 11 ; n ]      Establece la duración del pitido en ms.\n       ESC [ 12 ; n ]      Trae al frente la consola especificada.\n       ESC [ 13 ]          Quita el blanco de la pantalla.\n       ESC [ 14 ; n ]      Establece el intervalo de apagado VESA en min.\n\nCONJUNTOS DE CARACTERES\n       El núcleo sabe de 4 traducciones de bytes a símbolos de la pantalla de la consola. Las cuatro tablas son:\n       a) Latin1 -> PC,  b) gráficos VT100 -> PC, c) PC -> PC, d) definida por el usuario.\n\n       Hay dos conjuntos de caracteres, llamados G0 y G1, y uno de ellos es el actual. (Inicialmente G0.)\n\n       Teclear ^N hace que G1 sea el actual, ^O hace a G0 el actual.\n\n       Estas variables G0 y G1 apuntan a una tabla de  traducción,  y  pueden  ser  cambiadas  por  el  usuario.\n       Inicialmente  apuntan a las tablas a) y b) respectivamente.  Las secuencias ESC ( B y ESC ( 0 y ESC ( U y\n       ESC ( K causan que G0 apunte a la tabla a), b), c) y d) respectivamente.  Las secuencias ESC ) B y ESC  )\n       0 y ESC ) U y ESC ) K causan que G1 apunte a la tabla a), b), c) y d), respectivamente.\n\n       La  secuencia ESC c provoca una puesta a cero de la terminal, que es lo que uno quiere cuando la pantalla\n       está liada. El otrora truco \"echo ^V^O\" solamente hace G0 actual, pero no hay garantías de que G0  apunte\n       a  la  tabla a).  En algunas distribuciones hay un programa reset(1) que simplemente hace \"echo ^[c\".  Si\n       su entrada de terminfo para la consola es correcto (y tiene una entrada rs1=\\Ec), entonces  \"tput  reset\"\n       también funcionará.\n\n       La  tabla  de  asociación  definida  por  el  usuario  puede  ponerse con mapscrn(8).  El resultado de la\n       asociación es que si hay un símbolo c que se imprime, se envía a la memoria  de  vídeo  el  símbolo  s  =\n       map[c].  El  mapa  de  bits  que  corresponde a s se encuentra en la ROM de caracteres, y puede cambiarse\n       mediante setfont(8).\n\nPISTA DEL RATÓN\n       La facilidad de seguimiento de pista  del  ratón  sirve  para  devolver  informes  de  estado  del  ratón\n       compatibles  con  xterm. Puesto que el controlador de consola no tiene forma de conocer el dispositivo ni\n       tipo del ratón, estos informes se devuelven en el  flujo  de  entrada  de  la  consola  sólo  cuando  del\n       controlador  de  terminal  virtual  recibe  un  ioctl  de  actualización de ratón. Estos ioctls deben ser\n       generados por una aplicación de usuario que haga uso del ratón como el duende gpm(8).\n\n       Los parámetros para todas las secuencias de escape de pista del ratón generadas por xterm  codifican  los\n       parámetros  numéricos  en  un  simple  carácter  como  valor+040.   Por ejemplo, `!' es 1.  El sistema de\n       coordenadas de la pantalla empieza en 1.\n\n       El modo de compatibilidad X10 envía una secuencia de escape cuando  se  pulsa  un  botón  codificando  la\n       localización  y el botón del ratón pulsado.  Esto se activa enviando ESC [ ? 9 h y se desactiva con ESC [\n       ? 9 l.  Cuando se pulsa un botón, xterm envía ESC [ M bxy (6 caracteres).  Aquí b es botón-1, y x y y son\n       las  coordenadas x e y del ratón cuando se pulsó el botón.  Esto es el mismo código que el núcleo también\n       produce.\n\n       El modo de pista normal (no implementado en Linux 2.0.24) envía una secuencia de escape cuando se pulas o\n       se libera un botón. También se envía información de modificador. Se habilita enviando ESC [ ? 1000 h y se\n       inhabilita con ESC [ 1000 l.  Cuando se pulas o libera un botón, xtermenvía ESC [ M bxy.   Los  dos  bits\n       bajos  de b codifican información del botón: 0=MB1 pulsado, 1=MB2 pulsado, 2=MB3 pulsado, 3=liberar.  Los\n       bits más altos codifican qué modificadores estaban pulsados cuando el  botón  se  hubo  presionado  y  se\n       añaden  juntos: 4=Mayúsculas, 8=Meta, 16=Control.  De nuevo x e y son las coordenadas x e y del evento de\n       ratón. La esquina superior izquierda es (1,1).\n\nCOMPARACIONES CON OTRAS TERMINALES\n       Muchos tipos diferentes de terminal se describen, como la consola de  Linux,  como  `compatibles  VT100'.\n       Aquí  se  discuten las diferencias entre la consola de Linux y las otras dos más importantes, la VT102 de\n       DEC y la xterm(1).\n\n   Manejo de caracteres de control\n       La vt102 también reconocía los siguientes caracteres de control:\n\n       NUL (0x00) no era tenido en cuenta;\n\n       ENQ (0x05) lanzaba un mensaje de reconocimiento;\n\n       DC1 (0x11, ^Q, XON) reanudaba la transmisión;\n\n       DC3 (0x13, ^S, XOFF) hacía que la vt100 no tuviera en cuenta (y  parara  la  transmisión)  ningún  código\n              excepto XOFF y XON.\n\n       El controlador de tty puede habilitar el procesamiento de DC1/DC3 al estilo de la VT100.\n\n       El programa xterm (en modo vt100) reconoce los caracteres de control BEL, BS, HT, LF, VT, FF, CR, SO, SI,\n       ESC.\n\n   Secuencias de Escape\n       Secuncias de consola VT100 no implementadas en la consola de Linux:\n\n       ESC N       SS2   Simple cambio 2. (Selecciona el conjunto de caracteres\n                         G2 sólo para el sgute. carácter.)\n       ESC O       SS3   Simple cambio 3. (Selecciona el conjunto de caracteres\n                         G3 sólo para el sgute. carácter.)\n       ESC P       DCS   Cadena de control de dispositivo (acabada por ESC \\)\n       ESC X       SOS   Comienzo de cadena.\n       ESC ^       PM    Mensaje de privacidad (acabado por ESC \\)\n       ESC \\       ST    Terminador de caadena\n       ESC * ...         Designa el conjunto de caracteres G2\n       ESC + ...         Designa el conjunto de caracteres G3\n\n       El programa xterm (en modo vt100) reconoce ESC c, ESC # 8, ESC >, ESC =, ESC D, ESC E, ESC H, ESC M,  ESC\n       N,  ESC  O,  ESC  P  ...  ESC    ESC  Z  (responde ESC [ ? 1 ; 2 c, `Yo soy una vt100 con opción de vídeo\n       avanzado') y ESC ^ ... ESC  con los mismos significados que los arriba indicados.  Acepta ESC (,  ESC  ),\n       ESC  *,  ESC + seguidos por  0, A, B para el conjunto de caracteres especiales y líneas de dibujo de DEC,\n       UK y US-ASCII, respectivamente.  Acepta ESC ] para el establecimiento de ciertos recursos:\n\n       ESC ] 0 ; txt BEL     Pone nombre de icono y título de ventana como txt.\n       ESC ] 1 ; txt BEL     Pone txt como nombre de icono.\n       ESC ] 2 ; txt BEL     Pone txt como título de ventana.\n       ESC ] 4 6 ; log BEL   Cambia el nombre del fichero de registro a log\n                             (normalmente deshabilitado por una opción de tiempo de\n                             compilación)\n       ESC ] 5 0 ; fn BEL    Pone fn como el tipo de letra.\n\n       Reconoce lo siguiente con un significado ligeramente modificado:\n\n       ESC 7  DECSC   Salva el cursor\n       ESC 8  DECRC   Restaura el cursor\n\n       También reconoce\n\n       ESC F          Cursor a esquina inferior izda. de la pantalla (si\n                      permitido por el recurso hpLowerleftBugCompat)\n       ESC l          Bloqueo de memoria (por terminales HP).\n                      Bloquea la memoria sobre el cursor.\n       ESC m          Desbloqueo de memoria (por terminales HP).\n       ESC n   LS2    Invoca el conjunto de caracteres G2.\n       ESC o   LS3    Invoca el conjunto de caracteres G2.\n       ESC |   LS3R   Invoca el conjunto de caracteres G3 como GR.\n                      No tiene efecto visible en xterm.\n       ESC }   LS2R   Invoca el conjunto de caracteres G2 como GR.\n                      No tiene efecto visible en xterm.\n       ESC ~   LS1R   Invoca el conjunto de caracteres G1 como GR.\n                      No tiene efecto visible en xterm.\n\n       No reconoce ESC % ...\n\n   Secuencias CSI\n       El programa xterm (en XFree86 3.1.2G) no reconoce los  SGRs  de  modo  invisible  o  parpadeo.  Versiones\n       originales  X11R6 no reconocen los SGRs de establecimiento de colores.  Todas las otras secuencias CSI de\n       ECMA-48 reconocidas por Linux también lo son por xterm, y viceversa.\n\n       El programa xterm reconocerá todas las secuencias de Modo Privado de DEC listadas arriba, pero ninguna de\n       las secuencias de modo privado de Linux.  Para una discusión sobre las propias secuencias de modo privado\n       de xterm, refiérase al documento Xterm Control Sequences por Edward Moy & Stephen Gildea, disponible  con\n       la distribución X-Window.\n\n", "FALLOS": "       En 2.0.23, CSI no funciona, y NUL es tenido en cuenta dentro de secuencias de escape.\n\nVÉASE TAMBIÉN\n       console(4), console_ioctl(4), charsets(7)\n\nLinux                                            31 octubre 1996                                CONSOLE_CODES(4)\n"},{"NOMBRE": "       console ioctl - ioctl's para la terminal de consola y consolas virtuales\n\n", "DESCRIPCIÓN": "       Se admiten las siguientes peticiones ioctl() peculiares de Linux.  Cada una requiere un tercer argumento,\n       supuesto aquí como argp.\n\n       KDGETLED\n              Obtiene estado de los LEDs.  argp apunta a un long int.  Los 3 bits más bajos de  *argp  se  ponen\n              según el estado de los LEDs, como sigue:\n\n                  LED_CAP       0x04   LED Bloq. Mayús\n                  LEC_NUM       0x02   LED Bloq. Num\n                  LED_SCR       0x01   LED Bloq. Despl\n\n       KDSETLED\n              Enciende  los LEDs.  Los LEDs se encienden según los 3 bits más bajos de argp.  Sin embargo, si se\n              pone un bit de más alto orden, los LEDs se ponen a su funcionamiento normal: mostrar el estado  de\n              las   funciones   del   teclado:  bloqueo  de  mayúsculas,  de  teclado  auxiliar  numérico  y  de\n              desplazamiento.\n\n       Antes de 1.1.54, los LEDs simplemente reflejaban el estado de las correspondientes señales del teclado, y\n       KDGETLED/KDSETLED  tamibén  cambiaban  las  señales  del  teclado.  Desde 1.1.54, los LEDs pueden mostrar\n       información arbitraria, pero por omisión muestran las señales del teclado. Las 2  siguientes  llamadas  a\n       ioctl se usan para acceder a las señales del teclado.\n\n       KDGKBLED\n              Obtiene  las  señales del teclado Bloq.Mayús, BloqNum, BloqDespl (no las luces).  argp apunta a un\n              char que se pone con el estado de la señal.  Los 3 bits de más bajo orden (máscara  0x7)  obtienen\n              el estado de la señal actual, y los bits de más bajo orden de la siguiente cuarteta (máscara 0x70)\n              obtienen el estado de la señal predeterminado. (Desde 1.1.54.)\n\n       KDSKBLED\n              Pone las señales del teclado Bloq.Mayús, BloqNum, BloqDespl (no las luces).  argp tiene el  estado\n              de  la  señal deseado.  Los 3 bits de más bajo orden (máscara 0x7) tienen el estado de la señal, y\n              los bits de más bajo orden de la siguiente cuarteta (máscara 0x70) tienen el estado  de  la  señal\n              predeterminado. (Desde 1.1.54.)\n\n       KDGKBTYPE\n              Obtiene el tipo de teclado. Esto devuelve el valor KB_101, definido como 0x02.\n\n       KDADDIO\n              Añade puerto de E/S como válido. Equivale a ioperm(arg,1,1).\n\n       KDDELIO\n              Quita puerto de E/S como válido. Equivale a ioperm(arg,1,0).\n\n       KDENABIO\n              Habilita E/S a la tarjeta de vídeo. Equivale a ioperm(0x3b4, 0x3df-0x3b4+1, 1).\n\n       KDDISABIO\n              Inhabilita la E/S a la tarjeta de vídeo. Equivale a ioperm(0x3b4, 0x3df-0x3b4+1, 0).\n\n       KDSETMODE\n              Pone el modo de texto o gráfico.  argp es uno de éstos:\n\n                  KD_TEXT       0x00\n                  KD_GRAPHICS   0x01\n\n       KDGETMODE\n              Obtiene el modo de texto o gráfico.  argp apunta a un long int que se pone a uno de los valores de\n              arriba.\n\n       KDMKTONE\n              Genera un tono de la longitud especificada.  Los 16 bits más bajos de argp especifican el  periodo\n              en ciclos de reloj, y los 16 bits más altos dan la duración en ms.  Si la duración es 0, el sonido\n              se apaga.  Se devuelve  el  control  inmediatamente.   Por  ejemplo,  argp  =  (125<<16)  +  0x637\n              especificaría  el  pitido  asociado normalmente con un Ctrl-G.  (Este modo de funcionamiento desde\n              0.99pl1; infringido en 2.1.49-50.)\n\n       KIOCSOUND\n              Empieza o para la generación de sonido. Los 16 b más bajos  de  argp  especifican  el  periodo  en\n              ciclos  de  reloj  (esto  es, argp = 1193180÷frecuencia).  argp = 0 apaga el sonido.  En cualquier\n              caso, se devuelve el control inmediatamente.\n\n       GIO_CMAP\n              Obtiene el mapa de colores predeterminado actual del núcleo.  argp apunta a un vector de 48 bytes.\n              (Desde 1.3.3.)\n\n       PIO_CMAP\n              Cambia  el  mapa  de  colores  predeterminado  en  modo texto. argp apunta a un vector de 48 B que\n              contiene, en orden, los valores de Rojo,  Verde  y  Azul  para  los  16  colores  de  la  pantalla\n              sisponibles:  0  es  apagado,  y  255  es intensidad completa. Los colores predeterminados son, en\n              orden, negro, rojo oscuro, verde oscuro, marrón, azul oscuro, púrpura oscuro, celeste oscuro, gris\n              claro,  gris oscuro, rojo brillante, verde brillante, amarillo, azul brillante, púrpura brillante,\n              celeste brillante y blanco. (Desde 1.3.3.)\n\n       GIO_FONT\n              Obtiene el tipo de letra de pantalla de 256 caracteres en forma expandida. argp apunta a un vector\n              de  8192  B.  Falla  con  el  código  de error EINVAL si el tipo cargado actualmente es uno de 512\n              caracteres, o si la consola no está en modo texto.\n\n       GIO_FONTX\n              Obtiene el tipo de letra de  la  pantalla  e  información  asociada.  argp  apunta  a  una  struct\n              consolefontdesc  (vea  PIO_FONTX).   En el momento de la llamada, el campo charcount debería estar\n              puesto con el máximo número de caracteres que cupieran en el  búfer  apuntado  por  chardata.   Al\n              regresar,  los  campos  charcount  y  charheight  se llenan con los datos respectivos para el tipo\n              cargado actualmente, y el vector chardata contiene los datos del  tipo  si  el  valor  inicial  de\n              charcount  indicaba que había espacio suficiente disponible; de otra forma, el búfer queda intacto\n              y en errno se pone el valor ENOMEM. (Desde 1.3.1.)\n\n       PIO_FONT\n              Establece el tipo de letra de pantalla de 256  caracteres.  Carga  el  tipo  en  el  generador  de\n              caracteres  EGA/VGA.   argp  apunta  a un mapa de 8192 bytes, con 32 bytes por carácter.  Sólo los\n              primeros N de ellos se emplean para un tipo de 8×N (0 < N <= 32).  Esta llamada  también  invalida\n              la asociación Unicode.\n\n       PIO_FONTX\n              Establece el tipo de pantalla e información asociada de atributos de vídeo. argp apunta a una\n\n              struct consolefontdesc {\n                      u_short charcount;      /* caracteres en el tipo (256 ó 512) */\n                      u_short charheight;     /* líneas de rastreo por carácter (1-32) */\n                      char *chardata;         /* datos de tipo en forma expandida */\n              };\n\n              Si  es  necesario,  la  pantalla  se  redimensionará  apropiadamente,  y se enviará SIGWINCH a los\n              procesos apropiados. Esta llamada también invalida la asociación Unicode. (Desde 1.3.1.)\n\n       PIO_FONTRESET\n              Restaura el tipo de  letra  de  pantalla,  el  tamaño  y  la  asociación  Unicode  a  los  valores\n              predeterminados  en  el  arranque.  No  se  usa  argp, pero debe igualarse a NULL para asegurar la\n              compatibilidad con versiones futuras de Linux. (Desde 1.3.28.)\n\n       GIO_SCRNMAP\n              Obtiene del núcleo la asociación de pantalla. argp apunta a un área  de  tamaño  E_TABSZ,  que  se\n              carga en las posiciones del tipo usadas para mostrar cada carácter. Esta llamada más bien devuelve\n              información inútil si el tipo de letra cargado en la actualidad es de más de 256 caracteres.\n\n       GIO_UNISCRNMAP\n              Obtiene del núcleo la asociación de pantalla completa Unicode. argp apunta a  un  área  de  tamaño\n              E_TABSZ*sizeof(unsigned  short),  que  se carga con los Unicodes que representan cada carácter. Se\n              usa un conjunto  especial  de  Unicodes,  empezando  por  U+F000,  para  representar  asociaciones\n              ``directas al tipo''. (Desde 1.3.1.)\n\n       PIO_SCRNMAP\n              Carga  la  (4ª)  tabla ``definible por el usuario'' en el núcleo, que asocia bytes con símbolos de\n              pantalla de la consola. argp apunta a un área de tamaño E_TABSZ.\n\n       PIO_UNISCRNMAP\n              Carga en el núcleo la (4ª) tabla ``definible por el usuario'', que asocia bytes con Unicodes,  que\n              luego se traducen a símbolos de la pantalla según el mapa cargado en la actualidad Unicode-a-tipo.\n              Los Unicodes especiales que empiezan en U+F000 se pueden usar  para  asociar  directamente  a  los\n              símbolos del tipo. (Desde 1.3.1.)\n\n       GIO_UNIMAP\n              Obtiene del núcleo la asocación Unicode-a-tipo.  argp apunta a una\n\n              struct unimapdesc {\n                      u_short entry_ct;\n                      struct unipair *entries;\n              };\n\n              donde entries apunta a un vector de\n\n              struct unipair {\n                      u_short unicode;\n                      u_short fontpos;\n              };\n\n              (Desde 1.1.92.)\n\n       PIO_UNIMAP\n              Poner  la  asociación  Unicode-a-tipo  en  el núcleo. argp apunta a una struct unimapdesc.  (Desde\n              1.1.92)\n\n       PIO_UNIMAPCLR\n              Limpia la tabla, posiblemente informa al algoritmo de hash. argp apunta a una\n\n              struct unimapinit {\n                      u_short advised_hashsize;  /* 0 si no opinión */\n                      u_short advised_hashstep;  /* 0 si no opinión */\n                      u_short advised_hashlevel; /* 0 si no opinión */\n              };\n\n              (Desde 1.1.92.)\n\n       KDGKBMODE\n              Obtiene el modo de teclado en curso. argp apunta a un long int que toma una de estos valores:\n\n                  K_RAW         0x00\n                  K_XLATE       0x01\n                  K_MEDIUMRAW   0x02\n                  K_UNICODE     0x03\n\n       KDSKBMODE\n              Establece el modo de teclado actual.  argp es un long int igual a uno de los valores de antes.\n\n       KDGKBMETA\n              Obtiene el modo de manejo de la tecla META. argp apunta a un long int que se pone con uno de estos\n              valores:\n\n                  K_METABIT     0x03   pone a 1 el bit de más alto orden\n                  K_ESCPREFIX   0x04   prefijo de ESCAPE\n\n       KDSKBMETA\n              Establece  el  modo  de  manejo  de la tecla META.  argp es un long int igual a uno de los valores\n              anteriores.\n\n       KDGKBENT\n              Obtiene una entrada de la tabla de traducción de teclas (código de tecla a coigo de acción).  argp\n              apunta a una\n\n              struct kbentry {\n                  u_char kb_table;\n                  u_char kb_index;\n                  u_short kb_value;\n              };\n\n              con  los  primeros  dos  miembros  llenos: kb_table selecciona la tabla de teclas (0 <= kb_table <\n              MAX_NR_KEYMAPS), y kb_index es el código de tecla (0 <= kb_index < NR_KEYS).  kb_value se pone  al\n              código  de  acción  correspondiente,  o  K_HOLE  si no hay tal tecla, o K_NOSUCHMAP si kb_table es\n              inválido.\n\n       KDSKBENT\n              Establece una entrada en la tabla de traducción. argp apunta a una struct kbentry.\n\n       KDGKBSENT\n              Obtiene una cadena de tecla de función. argp apunta a una\n\n              struct kbsentry {\n                  u_char kb_func;\n                  u_char kb_string[512];\n              };\n\n              kb_string es pone a la cadena (terminada en cero) correspondiente al código de acción de la  tecla\n              de función kb_func-sima.\n\n       KDSKBSENT\n              Establece una entrada de cadena de tecla de función.  argp apunta a una struct kbsentry.\n\n       KDGKBDIACR\n              Lee la tabla de acentos del núcleo. argp apunta a una\n\n              struct kbdiacrs {\n                  unsigned int kb_cnt;\n                  struct kbdiacr kbdiacr[256];\n              };\n\n              donde kb_cnt es el número de entradas en el vector, cada una siendo una\n\n              struct kbdiacr { u_char diacr, base, result; };\n\n       KDGETKEYCODE\n              Lee una entrada de la tabla de códigos de teclas del núcleo (código de rastreo a código de tecla).\n              argp apunta a una\n\n              struct kbkeycode { unsigned int scancode, keycode; };\n\n              keycode se pone a un valor correspondiente al scancode dado.  (89 <= scancode  <=  255  solamente.\n              Para 1 <= scancode <= 88, keycode==scancode.)  (Desde 1.1.63.)\n\n       KDSETKEYCODE\n              Escribe una entrada de tabla de códigos de teclas del núcleo.  argp apunta a una struct kbkeycode.\n              (Desde 1.1.63.)\n\n       KDSIGACCEPT\n              El proceso que hace la llamada indica su voluntad de aceptar la señal argp cuando se genere por la\n              pulsación  de  una combinación de teclas apropiada.  (1 <= argp <= NSIG).  (Vea spawn_console() en\n              linux/drivers/char/keyboard.c.)\n\n       VT_OPENQRY\n              Devuelve la primera consola disponible (no abierta).  argp apunta a un int que se pone  al  número\n              de la vt (1 <= *argp <= MAX_NR_CONSOLES).\n\n       VT_GETMODE\n              Obtiene el modo de la vt activa.  argp apunta a una\n\n              struct vt_mode {\n                  char mode;     /* modo de la vt */\n                  char waitv;    /* si puesto, se cuelga en escrituras si no activa */\n                  short relsig;  /* señal a lanzar en petición de liberación */\n                  short acqsig;  /* señal a lanzar en adquisición */\n                  short frsig;   /* sin uso (a 0) */\n              };\n\n              mode se pone a uno de estos valores:\n\n                  VT_AUTO       cambio de vt automático\n                  VT_PROCESS    cambio de controles de proceso\n                  VT_ACKACQ     cambio de confirmación\n\n       VT_SETMODE\n              Establece el modo de la vt activa.  argp apunta a una struct vt_mode.\n\n       VT_GETSTATE\n              Obtiene información de estado global de vt. argp apunta a una\n\n              struct vt_stat {\n                  ushort v_active;  /* vt activa */\n                  ushort v_signal;  /* señal a enviar */\n                  ushort v_state;   /* máscara de bits de la vt */\n              };\n\n              Para  cada  vt  en  uso, el bit correspondiente en el miembro v_state se pone a 1.  (Núcleos 1.0 a\n              1.1.92.)\n\n       VT_RELDISP\n              Libera una pantalla.\n\n       VT_ACTIVATE\n              Cambia a la vt argp (1 <= argp <= MAX_NR_CONSOLES).\n\n       VT_WAITACTIVE\n              Espera hasta que la vt argp ha sido activada.\n\n       VT_DISALLOCATE\n              Desaloja la memoria asociada con la vt argp.  (Desde 1.1.54.)\n\n       VT_RESIZE\n              Establece la idea que tiene el núcleo del tamaño de pantalla. argp apunta a una\n\n              struct vt_sizes {\n                  ushort v_rows;       /* Nº de filas */\n                  ushort v_cols;       /* Nº de columnas */\n                  ushort v_scrollsize; /* ya no se usa */\n              };\n\n              Note que esto no cambia el modo de vídeo.  Vea resizecons(8).  (Desde 1.1.54.)\n\n       VT_RESIZEX\n              Establece la idea que tiene el núcleo sobre varios parámetros de pantalla.  argp apunta a una\n\n              struct vt_consize {\n                      ushort v_rows;          /* número de filas */\n                      ushort v_cols;          /* número de columnas */\n                      ushort v_vlin;          /* Nº de filas de píxeles en la pantalla */\n                      ushort v_clin;          /* Nº de filas de píxeles por carácter */\n                      ushort v_vcol;          /* Nº de cols. de píxeles en la pantalla */\n                      ushort v_ccol;          /* Nº de cols. de píxeles por carácter */\n              };\n\n              Cualquier parámetro puede ponerse a cero, indicando ``no hay cambio'', pero  si  se  ponen  varios\n              parámetros,  deben  ser  auto-consistentes.  Note  que  esto  no  cambia  el  modo  de  vídeo. Vea\n              resizecons(8). (Desde 1.3.3.)\n\n       La acción de las siguientes ioctls depende del primer byte en la struct apuntada por argp, referido  aquí\n       como el sub-código. Éstos son legales sólo para el súper-usuario o el propietario de la tty actual.\n\n       TIOCLINUX, sub-código=0\n              Vuelca  la  pantalla.  Desapareció en 1.1.92. (Con el núcleo 1.1.92 o superior, lee de /dev/vcsN o\n              /dev/vcsaN en su lugar.)\n\n       TIOCLINUX, sub-código=1\n              Obtiene información de tarea. Desapareció en 1.1.92.\n\n       TIOCLINUX, sub-código=2\n              Establece selección.  argp apunta a una\n\n                 struct {char subcode;\n                     short xs, ys, xe, ye;\n                     short sel_mode;\n                 }\n\n              xs e ys son las columna y fila de comienzo.  xe e ye son la columna y fila de final.  (La  esquina\n              superior  izquierda  es file=columna=1.)  sel_mode es 0 para selección carácter a carácter, 1 para\n              selección palabra a palabra, ó 2 para  selección  línea  a  línea.   Los  caracteres  de  pantalla\n              indicados se resaltan y salvan en el vector estático sel_buffer en devices/char/console.c.\n\n       TIOCLINUX, sub-código=3\n              Selección de pegado.  Los caracteres en el búfer de selección se escriben a fd.\n\n       TIOCLINUX, sub-código=4\n              Desblanquea la pantalla.\n\n       TIOCLINUX, sub-código=5\n              Establece los contenidos de una tabla de búsqueda de 256 b que define caracteres en una \"palabra\",\n              para la selección palabra a palabra. (Desde 1.1.32.)\n\n       TIOCLINUX, sub-código=6\n              argp apunta a un  char que se pone con el valor de la variable  del  núcleo  shift_state.   (Desde\n              1.1.32.)\n\n       TIOCLINUX, sub-código=7\n              argp  apunta  a  un  char  que  se  pone  al valor de la variable del núcleo report_mouse.  (Desde\n              1.1.33.)\n\n       TIOCLINUX, sub-código=8\n              Vuelca la anchura y altura de la pantalla, posición  de  cursor,  y  todos  los   pares  carácter-\n              atributo.   (Núcleos  1.1.67  a  1.1.91  solamente.   Con  el  núcleo  1.1.92  ó posterior, lee de\n              /dev/vcsa* en su lugar.)\n\n       TIOCLINUX, sub-código=9\n              Restaura la anchura y altura de la pantalla, posición de cursor,  y  todos  los   pares  carácter-\n              atributo.   (Núcleos  1.1.67  a  1.1.91  solamente.   Con el núcleo 1.1.92 ó posterior, escribe en\n              /dev/vcsa* en su lugar.)\n\n       TIOCLINUX, sub-código=10\n              Maneja la característica de Ahorro de Energía de la nueva generación de  monitores.   El  modo  de\n              blanqueo de pantalla VESA se pone a argp[1], que gobierna lo que hace el blanqueo de pantalla:\n\n                  0: El blanqueo de pantalla es deshabilitado.\n\n                  1: Se guardan los valores de los registros del adaptador de vídeo instalado, luego se programa\n              el controlador para apagar los pulsos de sincronización vertical.  Esto  pone  el  monitor  en  el\n              estado  de  \"modo de espera\". Si su monitor tiene un temporizador Off_Mode, entonces eventualmente\n              se apagará solo.\n\n                  2: Se salvan los valores actuales, luego se apagan los pulsos  de  sincronización  vertical  y\n              horizontal.   Esto  pone  el monitor en modo de \"apagado\".  Si su monitor no tiene el temporizador\n              Off_Mode, o si Ud. quiere que su monitor se apague inmediatamente cuando el tiempo del blank_timer\n              pase, entonces debe escoger esta opción.  (Precaución:: Apagar frecuentemente dañará el monitor.)\n\n              (Desde 1.1.76.)\n\nVALOR DEVUELTO\n       En caso de éxito se devuelve 0. En caso de error se devuelve -1 y errno toma un valor.\n\n", "ERRORES": "       errno puede tomar uno de estos valores:\n\n       EBADF  el descriptor de fichero es inválido.\n\n       ENOTTY el descriptor de fichero no está asociado con un dispositivo especial de caracteres, o la petición\n              especificada no se aplica a él.\n\n       EINVAL el descriptor de fichero o argp es inválido.\n\n       EPERM  violación de permiso.\n\n", "ATENCIÓN": "       No mire esta página del Manual como documentación sobre las ioctl's de la consola de Linux.  Esta  página\n       sólo  se  proporciona  para  el  curioso,  como una alternativa a leer los fuentes. Las ioctl's son cosas\n       internas de Linux indocumentadas, sujetas a cambios  sin  previo  aviso.  (Y  desde  luego,  esta  página\n       describe  más  o  menos  la  situación  en  los tiempos del núcleo versión 1.1.94; hay muchas diferencias\n       menores y no tan menores con versiones anteriores.)\n\n       Muy a menudo, las ioctl's se introducen para comunicación entre el núcleo y un programa  particular  bien\n       conocido  (fdisk,  hdparm,  setserial,  tunelp,  loadkeys, selection, setfont, etc.), y su comportamiento\n       cambiará cuando se requiera por este programa particular.\n\n       Los programas que usen estas ioctl's no serán transportables a otras versiones de Unix, no funcionarán en\n       versiones más antiguas de Linux, y no funcionarán en versiones futuras de Linux.\n\n       Use funciones POSIX.\n\nVÉASE TAMBIÉN\n       kbd_mode(1),  loadkeys(1),  dumpkeys(1),  mknod(1),  setleds(1),  setmetamode(1),  ioperm(2),  execve(2),\n       fcntl(2), termios(3), console(4), console_codes(4), mt(4), sd(4), tty(4), ttys(4), tty_ioctl(4),  vcs(4),\n       vcsa(4),     charsets(7),     mapscrn(8),     setfont(8),     resizecons(8),     /usr/include/linux/kd.h,\n       /usr/include/linux/vt.h\n\nLinux                                          18 septiembre 1995                              CONSOLE_IOCTLS(4)\n"},{"NOMBRE": "       dsp56k - interfaz con el dispositivo DSP56001\n\n", "SINOPSIS": "       #include <asm/dsp56k.h>\n\n       ssize_t read(int fd, void *data, size_t length);\n       ssize_t write(int fd, void *data, size_t length);\n       int ioctl(int fd, DSP56K_UPLOAD, struct dsp56k_upload *program);\n       int ioctl(int fd, DSP56K_SET_TX_WSIZE, int wsize);\n       int ioctl(int fd, DSP56K_SET_RX_WSIZE, int wsize);\n       int ioctl(int fd, DSP56K_HOST_FLAGS, struct dsp56k_host_flags *flags);\n       int ioctl(int fd, DSP56K_HOST_CMD, int cmd);\n\n", "CONFIGURACIÓN": "       El dispositivo dsp56k es un dispositivo de caracteres con número mayor 55 y número menor 0.\n\n", "DESCRIPCIÓN": "       El  Motorola  DSP56001  es  un  procesador  de señales digitales de 24 bits totalmente programable que se\n       encuentra en computadores compatibles con Atari Falcon030.  El fichero especial dsp56k  se  utiliza  para\n       controlar  el  DSP56001, y para enviar y recibir datos usando el puerto de host bidireccional mediante la\n       técnica de handshaking.\n\n       Para enviar un flujo de datos al procesador de señales, utilice write() con el dispositivo, y read() para\n       recibir datos procesados. Los datos pueden ser enviados o recibidos en cantidades de 8, 16, 24, o 32 bits\n       por parte del host, pero siempre serán interpretados como cantidades de 24 bits por el DSP56001.\n\n       Las siguientes llamadas ioctl(2) pueden utilizarse para controlar el dispositivo dsp56k:\n\n       DSP56K_UPLOAD\n              reinicia el DSP56001 y carga un programa. El tercer argumento a ioctl() debe ser un puntero a  una\n              estructura  dsp56k_binary  donde  el  miembro  bin  apuntará a un programa binario DSP56001, y len\n              contendrá la longitud del programa en palabras de 24 bits.\n\n       DSP56K_SET_TX_WSIZE\n              establece el tamaño de la palabra de transmisión. Los valores permitidos están en el intervalo  de\n              1  a  4,  y  definen  el  número  de  bytes  que serán enviados al mismo tiempo al DSP56001. Estas\n              cantidades de datos serán o bien rellenadas con bytes cero, o truncadas para  que  se  ajusten  al\n              formato nativo de 24 bits del DSP56001.\n\n       DSP56K_SET_RX_WSIZE\n              establece  el tamaño de la palabra de recepción. Los valores permitidos están en el intervalo de 1\n              a 4, y definen el número de bytes  que  serán  recibidos  al  mismo  tiempo  del  DSP56001.  Estas\n              cantidades  de  datos  serán  o bien rellenadas con bytes cero, o truncadas para que se ajusten al\n              formato nativo de 24 bits del DSP56001.\n\n       DSP56K_HOST_FLAGS\n              lee y escribe las banderas (flags) del host. Las banderas del host son cuatro  bits  de  propósito\n              general que pueden ser leídos tanto por la máquina anfitriona como por el DSP56001. Los bits 0 y 1\n              pueden ser escritos por el host, y los bits 2 y 3 pueden ser escritos por el DSP56001.\n\n              Para acceder a estas banderas del host, el tercer argumento a ioctl() debe ser un  puntero  a  una\n              estructura  dsp56k_host_flags.  Si  el  bit  0  o el bit 1 están activos en el miembro dir, el bit\n              correspondiente en out será escrito en las banderas del host. El estado de todas las banderas será\n              devuelto en los cuatro bits de orden inferior del miembro status.\n\n       DSP56K_HOST_CMD\n              envía  una  orden  de  anfitrión.  Los  valores  permitidos  están  en  el  intervalo de 0 a 31, y\n              especifican una orden definida por el usuario que es manejado por el programa que se ejecuta en el\n              DSP56001.\n\n", "FICHEROS": "       /dev/dsp56k\n\n", "AUTORES": "       Fredrik    Noring    <noring@nocrew.org>,    lars    brinkhoff    <lars@nocrew.org>,   Tomas   Berndtsson\n       <tomas@nocrew.org>.\n\nVÉASE TAMBIÉN\n       linux/include/asm-m68k/dsp56k.h,         linux/drivers/char/dsp56k.c,          http://dsp56k.nocrew.org/,\n       DSP56000/DSP56001 Digital Signal Processor User's Manual\n\nLinux                                             1 marzo 2000                                         DSP56K(4)\n"},{"NOMBRE": "       fd - dispositivo de disco flexible (disquetera)\n\n", "CONFIGURACIÓN": "       Las unidades de disco flexible son dispositivos hardware cuyo número mayor es 2. Tipicalmente, pertenecen\n       a root.floppy (es decir, usuario root, grupo floppy) y tienen o bien el modo  0660  (la  comprobación  de\n       acceso se realiza a través de la pertenencia al grupo) o bien el modo 0666 (cualquiera tiene acceso). Los\n       números menorer codifican el tipo de dispositivo, número de dispositivo, número de controlador. Para cada\n       tipo  de  dispositivo (es decir, combinación de densidad y número de pistas) hay un numero base menor.  A\n       este número base, suma el número de dispositivo en su controladora y 128 si el  dispositivo  está  en  el\n       controlador  secundario.   En  las  siguientes  tablas  de  dispositivos,  n  representan  el  número  de\n       dispositivo.\n\n       Cuidado: Si usas formatos con más pistas que las soportadas por tu  dispositivo,  puedes  causarle  daños\n       mecánicos.   Probar una vez si se soportan más pistas de las usuales 40/80 no debería dañarlo, pero no se\n       da ninguna garantía por ello.  No crees entradas de dispositivos para esos formatos para prevenir su  uso\n       si no estas seguro.\n\n       Ficheros independientes del dispositivo que detectan automáticamente el formato y la capacidad del medio:\n\n       Nombre   Nº base menor\n       ───────────────────────\n       fdn 0\n\n       Ficheros de dispositivos de doble densidad y 5.25\":\n\n       Nombre       Capac.   Cil.   Sect.   Cabez.   N\\[u00BA] base menor\n       ───────────────────────────────────────────────────────────────────\n       fdnd360      360K     40     9       2        4\n\n       Ficheros de dispositivos de alta densidad y 5.25\":\n\n       Nombre       Capac.   Cil.   Sect.   Cabez.   Nº base menor\n       ────────────────────────────────────────────────────────────\n       fdnh360      360K     40     9       2        20\n       fdnh410      410K     41     10      2        48\n       fdnh420      420K     42     10      2        64\n       fdnh720      720K     80     9       2        24\n       fdnh880      880K     80     11      2        80\n       fdnh1200     1200K    80     15      2        8\n       fdnh1440     1440K    80     18      2        40\n       fdnh1476     1476K    82     18      2        56\n       fdnh1494     1494K    83     18      2        72\n       fdnh1600     1600K    80     20      2        92\n\n       Ficheros de dispositivos de doble densidad y 3.5\":\n\n       Nombre       Capac.   Cil.   Sect.   Cabez.   Nº base menor\n       ────────────────────────────────────────────────────────────\n       fdnD360      360K     80     9       1        12\n       fdnD720      720K     80     9       2        16\n       fdnD800      800K     80     10      2        120\n       fdnD1040     1040K    80     13      2        84\n       fdnD1120     1120K    80     14      2        88\n\n       Ficheros de de dispositivos de alta densidad y 3.5\":\n\n       Nombre       Capac.   Cil.   Sect.   Cabez.   Nº base menor\n       ────────────────────────────────────────────────────────────\n\n       fdnH360      360K     40     9       2        12\n       fdnH720      720K     80     9       2        16\n       fdnH820      820K     82     10      2        52\n       fdnH830      830K     83     10      2        68\n       fdnH1440     1440K    80     18      2        28\n       fdnH1600     1600K    80     20      2        124\n       fdnH1680     1680K    80     21      2        44\n       fdnH1722     1722K    82     21      2        60\n       fdnH1743     1743K    83     21      2        76\n       fdnH1760     1760K    80     22      2        96\n       fdnH1840     1840K    80     23      2        116\n       fdnH1920     1920K    80     24      2        100\n\n       Ficheros de dispositivos de densidad extra y 3.5\":\n\n       Nombre       Capac.   Cil.   Sect.   Cabez.   Nº base menor\n       ────────────────────────────────────────────────────────────\n       fdnE2880     2880K    80     36      2        32\n       fdnCompaQ    2880K    80     36      2        36\n       fdnE3200     3200K    80     40      2        104\n       fdnE3520     3520K    80     44      2        108\n       fdnE3840     3840K    80     48      2        112\n\n", "DESCRIPCIÓN": "       Los  ficheros  especiales  fd  acceden a las unidades de disquete en modo crudo.  Las siguientes llamadas\n       ioctl(2) están soportadas por dispositivos fd:\n\n       FDCLRPRM\n              borra la información del medio de una unidad (geometría del disco en la unidad).\n\n       FDSETPRM\n              Establece la información del medio de una unidad. La información del medio se  perderá  cuando  se\n              cambie de medio.\n\n       FDDEFPRM\n              Establece  la  información  del  medio  de  una  unidad  (geometría  del  disco  en la unidad). La\n              información del medio no se perderá cuando se cambie de medio.  Esto desactivará la autodetección.\n              En orden a reactivar la autodetección, tienes que emitir un FDCLRPRM .\n\n       FDGETDRVTYP\n              devuelve el tipo de una unidad (parametro nombre).  Para formatos que funcionan en varios tipos de\n              unidad, FDGETDRVTYP devuelve un nombre el cuál es apropiado para el tipo de unidad más antiguo que\n              soporta este formato.\n\n       FDFLUSH\n              invalida el cache de buffer para la unidad dada.\n\n       FDSETMAXERRS\n              ajusta  el umbral de error para informar de errores, abortar la operación, recalibrar, reinicar la\n              unidad y leer sector a sector.\n\n       FDSETMAXERRS\n              obtiene el umbral actual de error.\n\n       FDGETDRVTYP\n              obtiene el nombre interno de la unidad.\n\n       FDWERRORCLR\n              borra la estadística de errores de escritura.\n\n       FDWERRORGET\n              lee la estadística de errores de escritura. Esto incluye el número total de errores de  escritura,\n              la  posición  y  disco  del  primer  error de escritura, y la posición y disco del último error de\n              escritura. Los discos se identifican mediante un número de generación el cuál  se  incrementa  (al\n              menos) en cada cambio de disco.\n\n       FDTWADDLE\n              Apaga el motor de la unidad por unos pocos microsegundos. Esto podría ser necesario para acceder a\n              un disco cuyos sectores están muy juntos.\n\n       FDSETDRVPRM\n              ajusta varios parametros de unidad.\n\n       FDGETDRVPRM\n              devuelve los parámetros anteriores.\n\n       FDGETDRVSTAT\n              obtiene el estado de la cache de la unidad (cambios de disco, protección de escritura)\n\n       FDPOLLDRVSTAT\n              consulta a la unidad y devuelve su estado.\n\n       FDGETFDCSTAT\n              obtiene el estado del controlador de la disquetera.\n\n       FDRESET\n              reinicia el controlador de la disquetera bajo ciertas condiciones.\n\n       FDRAWCMD\n              envía una orden directa al controlador de la disquetera.\n\n       Para  una  información  más  precisa,  consultar  también  los  ficheros  de  cabecera   <linux/fd.h>   y\n       <linux/fdreg.h>, así como la página de manual para floppycontrol.\n\n", "OBSERVACIONES": "       Los  diversos formatos permiten leer y escribir muchos tipos de discos.  No obstante, si un disquete está\n       formateado con un espacio entre sectores demasiado pequeño, el rendimiento puede caer, hasta el punto  de\n       necesitar  unos  pocos  segundos  para  acceder a una pista entera. Para prevenir esto, usar formatos con\n       entrelazado. No es posible leer discos que han sido formateados usando GCR(group code recording), la cuál\n       se  usa  en computadores Apple II y Macintosh (discos de 800K). No está soportada la lectura de disquetes\n       con los sectores marcados físicamente, mediante un agujero por sector.   Esto  solía  ser  común  en  los\n       viejos disquetes de 8 pulgadas.\n\n", "FICHEROS": "       /dev/fd*\n\n", "AUTORES": "       Alain Knaff (Alain.Knaff@imag.fr), David Niemi (niemidc@clark.net), Bill Broadhurst (bbroad@netcom.com).\n\nVÉASE TAMBIÉN\n       floppycontrol(1), mknod(1), chown(1), getfdprm(1), superformat(1), mount(8), setfdprm(8)\n\nLinux                                             29 Enero 1995                                            FD(4)\n"},{"NOMBRE": "       fifo - fichero especial \"primero en entrar, primero en salir\", tubería con nombre\n\n", "DESCRIPCIÓN": "       Un fichero especial FIFO (una tubería con nombre) es similar a una tubería, salvo que se accede a él como\n       parte del sistema de ficheros. Puede ser abierto por múltiples procesos para lectura o escritura.  Cuando\n       los  procesos  intercambian  datos  a  través de la FIFO, el núcleo pasa todos los datos internamente sin\n       escribirlos en el sistema de ficheros. Por tanto, el fichero especial  FIFO  no  tiene  contenido  en  el\n       sistema  de ficheros, la entrada del sistema de ficheros simplemente sirve como un punto de referencia de\n       tal manera que los procesos puedan acceder a la tubería usando un nombre del sistema de ficheros.\n\n       El núcleo mantiene exactamente un único objeto tubería para cada fichero especial  FIFO  que  es  abierto\n       por,  al menos, un proceso. Se debe abrir la FIFO en ambos extremos (de lectura y escritura) antes de que\n       se puedan pasar datos. Normalmente, la apertura de la FIFO se bloquea hasta que el otro  extremo  también\n       se abre.\n\n       Un proceso puede abrir una FIFO en modo no bloqueante. En este caso, abrir para sólo lectura tendrá éxito\n       incluso si nadie ha abierto todavía el lado de escritura. Abrir para sólo escritura fallará con una ENXIO\n       (no existe tal dispositivo o dirección) a menos que el otro extremo ya se haya abierto.\n\n       En  Linux,  abrir  una  FIFO  para  lectura  y  escritura  tendrá  éxito tanto en modo bloqueante como no\n       bloqueante. POSIX deja sin definir este comportamiento.  Esto se puede usar  para  abrir  una  FIFO  para\n       escribir  mientras  no  hay  lectores  disponibles. Un proceso que usa ambos extremos de la conexión para\n       comunicarse consigo mismo debería tener cuiado para evitar bloqueos mortales.\n\n", "OBSERVACIONES": "       Cuando un proceso intenta escribir en una FIFO que no está abierta para lectura en el otro  lado,  se  le\n       envía una señal SIGPIPE.\n\n       Los ficheros especiales FIFO se pueden crear con mkfifo(3) y se indican de manera especial en ls -l.\n\nVÉASE TAMBIÉN\n       mkfifo(3), mkfifo(1), pipe(2), socketpair(2), open(2), signal(2), sigaction(2)\n\nPágina Man de Linux                               20 junio 1999                                          FIFO(4)\n"},{"NOMBRE": "       full - dispositivo siempre lleno\n\n", "DESCRIPCIÓN": "       El  fichero  /dev/full tiene como número mayor de dispositivo el 1, y como número menor de dispositivo el\n       7.\n\n       Las escrituras en el dispositivo /dev/full fallarán con un error ENOSPC.\n\n       Las lecturas desde el dispositivo /dev/full devolverán caracteres nulos (\\0).\n\n       Las búsquedas en /dev/full siempre tendrán éxito.\n\n", "CONFIGURACIÓN": "       Si su sistema no tiene creado aún el dispositivo. /dev/full , éste se  puede  crear  con  las  siguientes\n       órdenes:\n               mknod -m 666 /dev/full c 1 7\n               chown root:root /dev/full\n\n", "FICHEROS": "       /dev/full\n\nVÉASE TAMBIÉN\n       mknod(1), null(4), zero(4)\n\nLinux                                             2 Agosto 1997                                          FULL(4)\n"},{"NOMBRE": "       futex - llamada al sistema para bloqueos rápidos en espacio de usuario\n\n", "SINOPSIS": "       #include <linux/futex.h>\n\n       #include <sys/time.h>\n\n       int sys_futex (void *futex, int op, int val, const struct timespec *timeout);\n\n", "DESCRIPCIÓN": "       La  llamada al sistema sys_futex proporciona un método que permite a un programa esperar hasta que cambie\n       el valor de una dirección dada y un método para despertar a cualquier proceso que esté esperando  en  una\n       dirección  particular (aunque las direcciones para una misma zona de memoria en procesos separados pueden\n       no ser iguales, el núcleo las proyecta internamente para que la misma memoria proyectada  en  direcciones\n       distintas  concuerde  para diferentes llamadas sys_futex). Típicamente se usa para implementar el caso de\n       contienda de un bloqueo en memoria compartida, como se describe en futex(4).\n\n       Cuando una operación futex(4) termina con contienda en espacio de usuario, es necesario hacer una llamada\n       al  núcleo  para  que  arbitre.  El  arbitraje  puede  significar  o  bloquear  al  proceso  invocador o,\n       contrariamente, despertar a un proceso bloqueado.\n\n       Se espera que los procesos que llamen a esta función  se  adhieran  a  la  semántica  que  se  expone  en\n       futex(4).  Ya que esta semántica supone escribir instrucciones en ensamblador no (trans)portables, esto a\n       su vez probablemente significa que la mayoría de los usuarios serán de hecho autores de bibliotecas y  no\n       desarrolladores genéricos de aplicaciones.\n\n       Es  necesario que el argumento futex apunte a un entero alineado que almacene el contador. La operación a\n       ejecutar se pasa a través del parámetro op junto con un valor val.\n\n       Actualmente se definen tres operaciones:\n\n       FUTEX_WAIT\n              Esta operación verifica atómicamente si la dirección  futex  contiene  todavía  el  valor  dado  y\n              bloquea  al  proceso a la espera de FUTEX_WAKE en esta dirección futex. Si el argumento timeout no\n              es NULL, su contenido describe la duración máxima de la espera, que es infinita en otro caso. Para\n              futex(4),  esta  llamada  se  ejecuta  si  al  decrementar el contador se obtuvo un valor negativo\n              (indicando contención) y se bloqueará hasta  que  otro  proceso  libere  el  futex  y  ejecute  la\n              operación FUTEX_WAKE.\n\n       FUTEX_WAKE\n              Esta  operación despierta, como mucho, val procesos que esperan en esta dirección futex (es decir,\n              dentro de FUTEX_WAIT).  Para futex(4), esta llamada se ejecuta si al incrementar  el  contador  se\n              vio  que había procesos esperando una vez que al futex se le ha asignado el valor 1 (indicando que\n              está disponible).\n\n       FUTEX_FD\n              Para soportar despertares asíncronos, esta operación asocia un descriptor de fichero con un futex.\n              Si  otro proceso ejecuta un FUTEX_WAKE, el proceso recibirá el número de señal que se pasó en val.\n              El proceso invocador debe cerrar el descriptor de fichero devuelto después de su uso.\n\n              Para evitar condiciones de carrera, el invocador debe comprobar si se  ha  incrementado  el  futex\n              después de que FUTEX_FD regrese.\n\nVALOR DEVUELTO\n       Dependiendo de la operación que se haya ejecutado, el valor devuelto puede tener significados diferentes.\n\n       FUTEX_WAIT\n              Devuelve  0  si  el  proceso  fue  despertado  por  una llamada FUTEX_WAKE. En el caso de que haya\n              expirado el plazo, se devuelve ETIMEDOUT. Si el futex no era igual al valor esperado, la operación\n              devuelve  EWOULDBLOCK.  Las  señales  (u  otros  falsos despertares) hacen que FUTEX_WAIT devuelva\n              EINTR.\n\n       FUTEX_WAKE\n              Devuelve el número de procesos despertados.\n\n       FUTEX_FD\n              Devuelve el nuevo descriptor de fichero asociado al futex.\n\n", "OBSERVACIONES": "       Insistimos, los futexes, en su forma más básica, no están pensados como  abstracción  sencilla  para  los\n       usuarios  finales.  Es  de  esperar  que los implementadores sean buenos conocedores de ensamblador y que\n       hayan leído los fuentes de la biblioteca de futex en espacio de usuario que se indica más abajo.\n\n", "AUTORES": "       Los futexes fueron diseñados e implementados por Hubertus Franke (IBM Thomas J. Watson Research  Center),\n       Matthew  Kirkwood,  Ingo  Molnar (Red Hat) y Rusty Russell (IBM Linux Technology Center). Esta página fue\n       escrita por Bert Hubert.\n\n", "VERSIONES": "       El soporte inicial para futex se añadió a la versión 2.5.7 de Linux pero con una semántica distinta a  la\n       descrita más arriba. La semántica actual se encuentra disponible desde la versión 2.5.40 de Linux.\n\nVÉASE TAMBIÉN\n       futex(4), `Fuss, Futexes and Furwocks: Fast Userlevel Locking in Linux' (actas del Ottawa Linux Symposium\n       2002),         biblioteca         de         ejemplo          de          futex,          futex-*.tar.bz2\n       <URL:ftp://ftp.nl.kernel.org:/pub/linux/kernel/people/rusty/>.\n\n                                                31 diciembre 2002                                       FUTEX(2)\n"},{"NOMBRE": "       hd - dispositivo de disco duro MFM/IDE\n\n", "DESCRIPCIÓN": "       hd*  son  los  dispositivos  de  bloque usados para acceder a los discos duros MFM/IDE en modo crudo (raw\n       mode).  El disco duro maestro de la controladora primaria IDE (dispositivo mayor número  3)  es  hda.  el\n       disco  esclavo es hdb.  El dico maestro en la segunda controladora (dispositivo mayor número 22) es hdc y\n       el esclavo hdd.\n\n       Los nombres de los dispositivos generales de bloque IDE son de la forma: hdX, o  hdXP,  donde  X  es  una\n       letra  que  denota  la  unidad  física, y P es un número que indica la partición en la unidad física.  La\n       primera forma aquí mostrada, hdX, es usada para  direccionar  la  unidad  entera.   Los  números  de  las\n       particiones  son  asignados  en  el  orden  que  se  descubran  las particiones, solo obtienen número las\n       particiones no vacías y no extendidas. Así mismo, los  números  del  1  al  4  se  toman  de  las  cuatro\n       particiones  descritas  en el Master Boot Record (las particiones llamadas primarias), independientemente\n       de que no se usen o sean extendidas.  Asi, la primera partición lógica será hdX5.\n\n       Están soportadas las particiones tipo DOS y BSD.  Puede tener hasta 63 particiones en un disco IDE.\n\n       Por ejemplo, /dev/hda se refiere a la la primera unidad IDE completa; y /dev/hdb3 se refiere a la tercera\n       particion primaria DOS en la segunda unidad.\n\n       Típicamente se crean con:\n\n              mknod -m 660 /dev/hda b 3 0\n              mknod -m 660 /dev/hda1 b 3 1\n              mknod -m 660 /dev/hda2 b 3 2\n              ...\n              mknod -m 660 /dev/hda8 b 3 8\n              mknod -m 660 /dev/hdb b 3 64\n              mknod -m 660 /dev/hdb1 b 3 65\n              mknod -m 660 /dev/hdb2 b 3 66\n              ...\n              mknod -m 660 /dev/hdb8 b 3 72\n              chown root:disk /dev/hd*\n\n", "FICHEROS": "       /dev/hd*\n\nVÉASE TAMBIÉN\n       mknod(1), chown(1), mount(8)\n\nLinux                                             30 Junio 1996                                            HD(4)\n"},{"NOMBRE": "       initrd - disco-RAM inicializado por el gestor de arranque\n\n", "DESCRIPCIÓN": "       El fichero especial /dev/initrd es un dispositivo de bloques de sólo lectura.  El dispositivo /dev/initrd\n       es un disco RAM que es inicializado (es decir, cargado) por el gestor  de  arranque  antes  de  cargar  e\n       iniciar  el  núcleo  del sistema.  Así, el núcleo puede utilizar el contenido del dispositivo /dev/initrd\n       para un arranque del sistema en dos fases.\n\n       En la primera fase del arranque, el núcleo pone en marcha y monta un sistema de ficheros raíz  inicial  a\n       partir  del contenido de /dev/initrd (o sea, el disco-RAM inicializado por el gestor de arranque).  En la\n       segunda fase, se cargan controladores adicionales u otros módulos desde el contenido del dispositivo raíz\n       inicial.   Tras  cargar los módulos adicionales, se monta un nuevo sistema de ficheros raíz (es decir, el\n       sistema de ficheros raíz habitual) desde un dispositivo diferente.\n\nFUNCIONAMIENTO DEL ARRANQUE\n       Cuando se arranca el sistema con initrd, ocurre lo siguiente:\n\n         1. El gestor de arranque ('boot loader') carga el núcleo y el contenido de /dev/initrd en memoria.\n\n         2. En la puesta en marcha del núcleo, éste descomprime y copia el contenido del disp.   /dev/initrd  en\n         el dispositivo /dev/ram0 y a continuación libera la memoria utilizada por /dev/initrd.\n\n         3.  Seguidamente, el núcleo monta el dispositivo /dev/ram0 en modo lectura/escritura como el sistema de\n         ficheros raíz inicial.\n\n         4. Si el sistema de ficheros raíz habitual indicado coincide con el sistema de  ficheros  raíz  inicial\n         (por  ejemplo,  /dev/ram0  )  entonces el núcleo salta directamente al último paso para la secuencia de\n         arranque habitual.\n\n         5. Si el fichero ejecutable /linuxrc está presente en el sistema de ficheros raíz inicial,  se  ejecuta\n         con  uid  (identificador  de  usuario)  0.   (El  fichero /linuxrc debe tener permiso de ejecución.  El\n         fichero /linuxrc puede ser cualquier ejecutable válido, incluyendo los guiones de cualquier  procesador\n         de órdenes -'shell scripts'.)\n\n         6.  Si no se ejecuta /linuxrc o cuando /linuxrc termina, se monta el sistema de ficheros raíz habitual.\n         (Si /linuxrc  termina  con  algún  sistema  de  ficheros  montado  en  el  raíz  inicial,  entonces  el\n         comportamiento  del  núcleo  es  INDETERMINADO.   (Vea  la  sección  OBSERVACIONES  para  consultar  el\n         comportamiento actual del núcleo.)\n\n         7. Si el sistema de ficheros 'habitual' contiene el directorio /initrd,  el  dispositivo  /dev/ram0  se\n         mueve desde / a /initrd.  En otro caso, si el directorio /initrd no existe, el dispositivo /dev/ram0 se\n         desmonta.  (Cuando es movido desde / a /initrd, /dev/ram0 no se desmonta,  y  por  tanto  los  procesos\n         pueden  permanecer  funcionando  desde  /dev/ram0.  Si el directorio /initrd no existe en el sistema de\n         ficheros raíz habitual y queda algún proceso en funcionamiento sobre /dev/ram0 cuando /linuxrc termina,\n         el  comportamiento  del  núcleo  es  INDETERMINADO.   Vea la sección de OBSERVACIONES para consultar el\n         comportamiento actual del núcleo.)\n\n         8. La secuencia de arranque/inicio habitual (por ejemplo, la ejecución de /sbin/init) se realiza en  el\n         sistema de ficheros habitual.\n\n", "OPCIONES": "       Las  siguientes  opciones  del  gestor  de arranque, cuando se utilizan con initrd, alteran el proceso de\n       puesta en marcha del núcleo:\n\n       initrd=nombre_de_fichero\n              Especifica el fichero a cargar como el contenido de /dev/initrd.  Para LOADLIN esta es una  opción\n              de  línea  de  órdenes.  Para LILO tiene que utilizar este orden en el fichero de configuración de\n              LILO, /etc/lilo.config.  El nombre de fichero indicado con esta opción será normalmente una imagen\n              del sistema de ficheros comprimida con GZip.\n\n       noinitrd\n              Esta  opción  de arranque deshabilita la operación de arranque en dos fases.  El núcleo realiza la\n              secuencia de arranque habitual como si /dev/initrd no hubiera sido inicializado.  Con esta opción,\n              cualquier contenido de /dev/initrd cargado en la memoria por el 'boot loader' es preservado.  Esta\n              opción permite que /dev/initrd contenga cualquier clase de datos y no esté limitado a  una  imagen\n              de  sist. de ficheros.  De todas formas, el dispositivo /dev/initrd es de sólo-lectura y puede ser\n              leído sólo una vez tras la puesta en marcha del sistema.\n\n       root=nombre-de-dispositivo\n              Especifica el dispositivo que será utilizado como sistema de ficheros normal (raíz).  Para LOADLIN\n              esta  es una opción de línea de órdenes.  Para LILO esta es una opción para el momento de arranque\n              o puede utilizarse como línea de opción en el fichero de configuración de LILO,  /etc/lilo.config.\n              El dispositivo indicado por la opción debe ser un dispositivo 'montable', y contener un sistema de\n              ficheros raíz adecuado.\n\nCAMBIAR EL SISTEMA DE FICHEROS RAÍZ HABITUAL\n       Por defecto, las opciones establecidas del núcleo (p. ej. establecidas en el fichero del núcleo  mediante\n       rdev  o  compiladas dentro del mismo), o el establecimiento de opciones del 'boot loader' se utiliza para\n       los sistemas de ficheros normales.  Para un sistema de fich. raíz montado como NFS, debemos utilizar  las\n       opciones  de  arranque  nfs_root_name  y nfs_root_addrs para proporcionar/establecer las opciones de NFS.\n       Para más información sobre sistemas raíz montados como NFS, vea el fichero de  documentación  del  núcleo\n       nfsroot.txt.   Para más información sobre el establecimiento del sistema de ficheros raíz, vea también la\n       doc. de LILO y LOADLIN.\n\n       También es posible para el ejecutable de /linuxrc cambiar el dispositivo  raíz  por  defecto.   Para  que\n       /linuxrc  cambie  este  dispositivo, /proc debe ser montado.  Tras montar /proc, /linuxrc cambia el disp.\n       raíz habitual escribiendo en los ficheros /proc/sys/kernel/real-root-dev, /proc/sys/kernel/nfs-root-name,\n       y /proc/sys/kernel/nfs-root-addrs.  Para un dispositivo raíz físico, éste se cambia haciendo que /linuxrc\n       escriba el nuevo número de sistema de ficheros en /proc/sys/kernel/real-root-dev.  Para un  sistema  raíz\n       NFS,  el  disp.  raíz  se  cambia  haciendo  que  /linuxrc  escriba  la  opción  de  NFS  en los ficheros\n       /proc/sys/kernel/nfs-root-name y /proc/sys/kernel/nfs-root-addrs y después escriba 0xff (p.ej. el  número\n       de pseudo-dispositivo-NFS) en el fichero /proc/sys/kernel/real-root-dev.  Por ejemplo, la siguiente línea\n       de órdenes del shell cambiaría el disp. raíz a /dev/hdb1:\n               echo 0x365 >/proc/sys/kernel/real-root-dev\n       Como ejemplo para sistemas NFS, las siguientes líneas  de  órdenes  cambiarían  el  dispositivo  raíz  al\n       directorio  NFS  /var/nfsroot  en  un servidor NFS local con dirección IP 193.8.232.7 para un sistema con\n       dirección 193.8.232.7 llamado 'idefix':\n            echo /var/nfsroot >/proc/sys/kernel/nfs-root-name\n            echo 193.8.232.2:193.8.232.7::255.255.255.0:idefix \\\n              >/proc/sys/kernel/nfs-root-addrs\n            echo 255 >/proc/sys/kernel/real-root-dev\n\n", "UTILIZACIÓN": "       La principal motivación para implementar initrd fue la de permitir una configuración modular  del  núcleo\n       en el momento de la instalación.\n\n       Aquí se describe un posible escenario de la instalación del sistema:\n\n         1.  El  programa  cargador  arranca desde disquete u otro medio con un núcleo mínimo (p.ej. con soporte\n         para /dev/ram, /dev/initrd, y el sistema  de  ficheros  ext2)  y  carga  /dev/initrd  con  una  versión\n         comprimida (con gzip) del sistema de ficheros inicial.\n\n         2.  El  ejecutable  /linuxrc determina lo que se necesita para montar, mount(1), el sistema de ficheros\n         raíz normal (p.ej. tipo de dispositivo, controladores, sistema  de  ficheros)  y  (2)  el  formato  'de\n         distribución'   (p.ej.  CD-ROM,  red,  cinta,  ...).  Esto  se  puede  hacer  preguntando  al  usuario,\n         tanteando/probando automáticamente, o mediante una aproximación mixta.\n\n         3. El ejecutable /linuxrc carga los módulos necesarios desde el sistema de ficheros inicial.\n\n         4. El ejecutable /linuxrc crea y 'expande' el sistema de ficheros raíz. (En esta etapa, el sistema raíz\n         no tiene por qué ser aún un sistema completo.)\n\n         5.  El  ejecutable  /linuxrc  establece  /proc/sys/kernel/real-root-dev,  desmonta /proc, el sistema de\n         ficheros raíz y cualquier otro sist. de ficheros que hubiese montado, y entonces termina.\n\n         6. El núcleo entonces monta el sistema de ficheros definitivo.\n\n         7. Ahora que el sist. de ficheros está accesible e intacto, el gestor de arranque puede ser instalado.\n\n         8. El gestor de arranque está configurado para cargarse en /dev/initrd, un sistema de ficheros  con  el\n         conjunto de módulos que fue utilizado para poner en marcha el sistema.  (p.ej. El dispositivo /dev/ram0\n         puede ser modificado, después desmontado, y finalmente, la imagen  es  escrita  desde  /dev/ram0  a  un\n         fichero.)\n\n         9. El sistema es ahora capaz de arrancar, y se pueden abordar nuevas tareas de la instalación.\n\n       El  papel  clave  de  /dev/initrd en el proceso es el de reutilizar los datos de configuración durante el\n       funcionamiento habitual del sistema sin que se requiera una selección inicial del  núcleo,  o  un  núcleo\n       genérico demasiado grande, o recompilarlo.\n\n       Un  segundo  escenario  se  presenta para instalaciones en las que Linux corre en sistemas con diferentes\n       configuraciones 'hardware' en una misma red.  En estos casos, puede ser deseable utilizar sólo un pequeño\n       conjunto  de núcleos (idealmente, uno) y mantener la parte específica de la configuración de cada sistema\n       tan pequeña como sea posible.  En este caso, se crea un fichero común con todos los  módulos  requeridos.\n       Entonces, sólo el fichero /linuxrc o un fichero ejecutado por /linuxrc sería diferente.\n\n       Un  tercer  ejemplo es más conveniente para discos 'de rescate'.  Debido a que cierta información como la\n       localización de la partición del sistema de ficheros raíz no se necesita en el momento del  arranque,  el\n       sistema  cargado desde /dev/initrd puede utilizar un diálogo y/o autodetección seguido posiblemente de un\n       chequeo a este sistema de ficheros.\n\n       Por último, pero no menos importante, las distribuciones de Linux en CD-ROM pueden utilizar  initrd  para\n       facilitar  la  instalación  desde  el  CD-ROM.   La  distribución  puede  utilizar  LOADLIN  para  cargar\n       directamente /dev/initrd desde el CD-ROM sin necesitar ningún disquete.  La distribución  podría  también\n       utilizar  un  disco de arranque con LILO y después cargar un disco-ram más grande a través de /dev/initrd\n       desde el CD-ROM.\n\n", "CONFIGURACIÓN": "       El dispositivo de bloques /dev/initrd es de sólo lectura, al que se le asigna como número mayor 1 y  como\n       número  menor 250. Típicamente /dev/initrd es propiedad de root:disk con modo 0400 (con acceso de lectura\n       sólo para el 'root').  Si el  sistema  no  tiene  creado  /dev/initrd  todavía,  puede  crearse  con  las\n       siguientes órdenes:\n               mknod -m 400 /dev/initrd b 1 250\n               chown root.disk /dev/initrd\n       También,  el  soporte  tanto  para  \"disco  RAM\"  y  \"disco  RAM  Inicial\" (p.ej.  CONFIG_BLK_DEV_RAM=y y\n       CONFIG_BLK_DEV_INITRD=y  )  debe  ser  compilado  directamente  en  el  núcleo  de  Linux  para  utilizar\n       /dev/initrd.  Cuando se usa /dev/initrd, el controlador del disco RAM no se puede cargar como módulo.\n\n", "FICHEROS": "       /dev/initrd\n       /dev/ram0\n       /linuxrc\n       /initrd\n\nVÉASE TAMBIÉN\n       chown(1),  mknod(1),  /dev/ram(4),  freeramdisk(8), rdev(8), El fichero de documentación initrd.txt en el\n       paquete de  los  fuentes  del  núcleo,  la  documentación  de  LILO,  la  documentación  de  LOADLIN,  la\n       documentación de SYSLINUX.\n\n", "OBSERVACIONES": "       1.  Con el núcleo actual, cualquier sistema de ficheros que permanezca montado cuando /dev/ram0 es movido\n       desde / a /initrd  continúa  siendo  accesible.  Sin  embargo,  la  información  en  /proc/mounts  no  es\n       actualizada.\n\n       2.  Con  el  núcleo  actual, si el directorio /initrd no existe, entonces /dev/ram0 no será completamente\n       desmontado si /dev/ram0 está siendo utilizado por algún proceso o  mantiene  algún  sistema  de  ficheros\n       montado en él.  Si no se desmonta completamente /dev/ram0 , entonces /dev/ram0 permanecerá en memoria.\n\n       3.  Los usuarios de /dev/initrd no deberían depender del comportamiento indicado en las notas anteriores.\n       Este comportamiento puede cambiar en futuras versiones del núcleo de Linux.\n\n", "AUTOR": "       El  código  del  núcleo  para  el  dispositivo  initrd   ha   sido   escrito   por   Werner   Almesberger\n       <almesber@lrc.epfl.ch>  y  Hans  Lermen  <lermen@elserv.ffm.fgan.de>.  El código para initrd se añadió al\n       código básico del núcleo en la versión de desarrollo 1.3.73.\n\nLinux 2.0                                       6 Noviembre 1997                                       INITRD(4)\n"},{"NOMBRE": "       intro - Introducción a órdenes de usuario\n\n", "DESCRIPCIÓN": "       Este capítulo describe órdenes de usuario.\n\n", "AUTORES": "       Busque  en  la cabecera de cada página del Manual el autor o autores y las condiciones sobre los derechos\n       de copia. ¡Observe que éstos pueden ser diferentes de una página a otra!\n\nLinux                                          24 de Julio de 1993                                      INTRO(1)\n"},{"NOMBRE": "       mem, kmem, port - memoria del sistema, memoria del núcleo y puertos del sistema.\n\n", "DESCRIPCIÓN": "       mem  es  un  fichero de dispositivo de caracteres que representa a la memoria principal del ordenador. Se\n       puede utilizar, por ejemplo, para examinar (e incluso parchear) el sistema.\n\n       En mem, las direcciones de bytes se interpretan como direcciones físicas de memoria.  Las  referencias  a\n       posiciones no existentes producen un error.\n\n       El  examinar  y  parchear posiciones de memoria que contienen bits de sólo-lectura o sólo-escritura puede\n       conducir a resultados inesperados.\n\n       Normalmente se crea con:\n\n              mknod -m 660 /dev/mem c 1 1\n              chown root:mem /dev/mem\n\n       El archivo kmem es idéntico a mem, excepto que se accede a la memoria virtual del núcleo, en vez de a  la\n       memoria física.\n\n       Normalmente se crea con:\n\n              mknod -m 640 /dev/kmem c 1 2\n              chown root:mem /dev/kmem\n\n       port es similar a mem, pero se accede a los puertos de E/S.\n\n       Normalmente se crea con:\n\n              mknod -m 660 /dev/port c 1 4\n              chown root:mem /dev/port\n\n", "FICHEROS": "       /dev/mem\n       /dev/kmem\n       /dev/port\n\nVÉASE TAMBIÉN\n       mknod(1), chown(1), ioperm(2)\n\nLinux                                           21 Noviembre 1992                                         MEM(4)\n"},{"NAME": "       lp - print files\n\n", "SYNOPSIS": "       lp  [  -E  ] [ -U username ] [ -c ] [ -d destination[/instance] ] [ -h hostname[:port] ] [ -m ] [ -n num-\n       copies ] [ -o option[=value] ] [ -q priority ] [ -s ] [ -t title ] [ -H handling ] [ -P page-list ] [  --\n       ] [ file(s) ]\n       lp  [  -E  ]  [  -U  username  ]  [  -c ] [ -h hostname[:port] ] [ -i job-id ] [ -n num-copies ] [ -o op‐\n       tion[=value] ] [ -q priority ] [ -t title ] [ -H handling ] [ -P page-list ]\n\n", "DESCRIPTION": "       lp submits files for printing or alters a pending job.  Use a filename of \"-\" to force printing from  the\n       standard input.\n\n   THE DEFAULT DESTINATION\n       CUPS  provides many ways to set the default destination. The LPDEST and PRINTER environment variables are\n       consulted first.  If neither are set, the current default set using the  lpoptions(1)  command  is  used,\n       followed by the default set using the lpadmin(8) command.\n\n", "OPTIONS": "       The following options are recognized by lp:\n\n       --   Marks the end of options; use this to print a file whose name begins with a dash (-).\n\n       -E   Forces encryption when connecting to the server.\n\n       -U username\n            Specifies the username to use when connecting to the server.\n\n       -c   This  option  is  provided for backwards-compatibility only. On systems that support it, this option\n            forces the print file to be copied to the spool directory before printing.  In CUPS, print files are\n            always sent to the scheduler via IPP which has the same effect.\n\n       -d destination\n            Prints files to the named printer.\n\n       -h hostname[:port]\n            Chooses an alternate server.\n\n       -i job-id\n            Specifies an existing job to modify.\n\n       -m   Sends an email when the job is completed.\n\n       -n copies\n            Sets the number of copies to print.\n\n       -o \"name=value [ ... name=value ]\"\n            Sets one or more job options.  See \"COMMON JOB OPTIONS\" below.\n\n       -q priority\n            Sets the job priority from 1 (lowest) to 100 (highest).  The default priority is 50.\n\n       -s   Do not report the resulting job IDs (silent mode.)\n\n       -t \"name\"\n            Sets the job name.\n\n       -H hh:mm\n\n       -H hold\n\n       -H immediate\n\n       -H restart\n\n       -H resume\n            Specifies  when  the job should be printed.  A value of immediate will print the file immediately, a\n            value of hold will hold the job indefinitely, and a UTC time value (HH:MM) will hold the  job  until\n            the  specified UTC (not local) time.  Use a value of resume with the -i option to resume a held job.\n            Use a value of restart with the -i option to restart a completed job.\n\n       -P page-list\n            Specifies which pages to print in the document.  The list can contain a list of numbers  and  ranges\n            (#-#) separated by commas, e.g., \"1,3-5,16\".  The page numbers refer to the output pages and not the\n            document's original pages - options like \"number-up\" can affect the numbering of the pages.\n\n   COMMON JOB OPTIONS\n       Aside from the printer-specific options reported by the lpoptions(1) command, the following  generic  op‐\n       tions are available:\n\n       -o job-sheets=name\n            Prints  a  cover  page  (banner) with the document.  The \"name\" can be \"classified\", \"confidential\",\n            \"secret\", \"standard\", \"topsecret\", or \"unclassified\".\n\n       -o media=size\n            Sets the page size to size. Most printers support at least the size names \"a4\", \"letter\",  and  \"le‐\n            gal\".\n\n       -o number-up={2|4|6|9|16}\n            Prints 2, 4, 6, 9, or 16 document (input) pages on each output page.\n\n       -o orientation-requested=4\n            Prints the job in landscape (rotated 90 degrees counter-clockwise).\n\n       -o orientation-requested=5\n            Prints the job in landscape (rotated 90 degrees clockwise).\n\n       -o orientation-requested=6\n            Prints the job in reverse portrait (rotated 180 degrees).\n\n       -o print-quality=3\n\n       -o print-quality=4\n\n       -o print-quality=5\n            Specifies the output quality - draft (3), normal (4), or best (5).\n\n       -o sides=one-sided\n            Prints on one side of the paper.\n\n       -o sides=two-sided-long-edge\n            Prints on both sides of the paper for portrait output.\n\n       -o sides=two-sided-short-edge\n            Prints on both sides of the paper for landscape output.\n\nCONFORMING TO\n       Unlike  the System V printing system, CUPS allows printer names to contain any printable character except\n       SPACE, TAB, \"/\", or \"#\".  Also, printer and class names are not case-sensitive.\n\n       The -q option accepts a different range of values than the Solaris lp command, matching the IPP job  pri‐\n       ority  values  (1-100,  100 is highest priority) instead of the Solaris values (0-39, 0 is highest prior‐\n       ity).\n\n", "EXAMPLES": "       Print two copies of a document to the default printer:\n\n           lp -n 2 filename\n\n       Print a double-sided legal document to a printer called \"foo\":\n\n           lp -d foo -o media=legal -o sides=two-sided-long-edge filename\n\n       Print a presentation document 2-up to a printer called \"bar\":\n\n           lp -d bar -o number-up=2 filename\n\nSEE ALSO\n       cancel(1), lpadmin(8), lpoptions(1), lpq(1), lpr(1), lprm(1), lpstat(1), CUPS Online Help  (http://local‐\n       host:631/help)\n\n", "COPYRIGHT": "       Copyright © 2007-2019 by Apple Inc.\n\n26 April 2019                                         CUPS                                                 lp(1)\n"},{"NOMBRE": "       magic - fichero de números mágicos para la orden file\n\n", "DESCRIPCIÓN": "       Esta página del Manual documenta el formato del fichero mágico que emplea la orden file(1), versión 3.26.\n       La orden file identifica el tipo de un fichero utilizando, entre  otras  pruebas,  una  que  mira  si  el\n       fichero  empieza  con  un  cierto número mágico.  El fichero /usr/share/misc/magic especifica qué números\n       mágicos hay que buscar, qué mensaje mostrar si se encuentra un número mágico en particular, e información\n       adicional que haya que extraer del fichero.\n\n       Cada  línea  del fichero especifica una prueba a realizar.  Una prueba compara los datos que comiencen en\n       una posición particular en el fichero con un valor numérico de 1, 2 ó 4 bytes o una cadena de caracteres.\n       Si la prueba tiene éxito, se muestra un mensaje. La línea consiste en los campos siguientes:\n\n       desplazamiento\n                Un  número  que  especifica el desplazamiento, en bytes, desde el principio del fichero de datos\n                que se esté comprobando.\n\n       tipo     El tipo de los datos a comprobar. Los valores posibles son:\n\n                byte     Un valor de un byte.\n\n                short    Un valor de dos bytes (en la mayoría de los sistemas) en el orden de bytes nativo de la\n                         máquina.\n\n                long     Un valor de cuatro bytes (en la mayoría de los sistemas) en el orden de bytes nativo de\n                         la máquina.\n\n                string   Una cadena de bytes.\n\n                date     Un valor de cuatro bytes interpretado como una fecha de Unix.\n\n                beshort  Un valor de dos bytes (en la mayoría de los sistemas) en  orden  de  bytes  ascendiente\n                         hacia la derecha.\n\n                belong   Un  valor  de cuatro bytes (en la mayoría de los sistemas) en orden de bytes ascendente\n                         hacia la derecha.\n\n                bedate   Un valor de cuatro bytes (en la mayoría de los sistemas) en orden de  bytes  ascendente\n                         hacia la derecha, interpretado como una fecha de Unix.\n\n                leshort  Un  valor  de  dos  bytes  (en la mayoría de los sistemas) en orden de bytes ascendente\n                         hacia la izquierda.\n\n                lelong   Un valor de cuatro bytes (en la mayoría de los sistemas) en orden de  bytes  ascendente\n                         hacia la izquierda.\n\n                ledate   Un  valor  de cuatro bytes (en la mayoría de los sistemas) en orden de bytes ascendente\n                         hacia la izquierda, interpretado como una fecha de Unix.\n\n       Los tipos numéricos pueden opcionalmente ir seguidos por & y  un  valor  numérico,  para  especificar  la\n       operación  de  bits  Y  con dicho valor antes de que se realice la comparación. Preceder el tipo de una u\n       indica que las comparaciones ordenadas deben hacerse sobre valores sin signo.\n\n       test   El valor a ser comparado con el valor  del  fichero.  Si  el  tipo  es  numérico,  este  valor  se\n              especifica  como  en  el  lenguaje  C;  si  es  una  cadena,  como  una cadena de caracteres de C,\n              permitiéndose las secuencias de escape habituales (como \\n para la nueva línea).\n\n              Los valores numéricos pueden  hacerse  preceder  por  un  carácter  que  indique  la  operación  a\n              realizarse.  Puede  ser =, para especificar que el valor del fichero debe igualar al especificado,\n              <, para especificar que el valor del fichero debe ser menor que el  valor  especificado,  >,  para\n              especificar que el valor del fichero debe ser mayor que el valor especificado, &, para especificar\n              que el valor del fichero debe tener a 1 todos los bits que estén a 1 en el valor especificado,  ^,\n              para  especificar  que el valor del fichero debe tener a 0 cualquiera de los bits que estén a 1 en\n              el valor especificado, o x, para especificar que cualquier valor concordará.  Si  el  carácter  se\n              omite, se asume que es =.\n\n              Los  valores  numéricos se especifican como en C; por ejemplo, 13 es en base diez, 013 es octal, y\n              0x13 es hexadecimal.\n\n              Para valores de cadena, la cadena de bytes del fichero debe  concordar  con  la  cadena  de  bytes\n              especificada.   Los  operadores  =,  <  y  >  (pero no &) pueden aplicarse a cadenas.  La longitud\n              empleada para la concordancia es la del argumento cadena en el fichero mágico. Esto significa  que\n              una  línea  puede  concordar con cualquier cadena, y por tanto presumiblemente mostrarla, haciendo\n              >\\0 (porque todas las cadenas son mayores que la cadena nula).\n\n       mensaje\n              EL mensaje a mostrarse si la comparación tiene éxito. Si la cadena contiene una especificación  de\n              formato  como  las de printf(3S), el valor del fichero (con cualquier enmascaramiento especificado\n              ya realizado) se muestra empleando el mensaje como la cadena de formato.\n\n       Algunos formatos de fichero contienen información adicional  que  se  mostrará  junto  con  el  tipo  del\n       fichero.  Una  línea que comience con el carácter > indica pruebas y mensajes a mostrarse adicionales. El\n       número de > en la línea indica el nivel de la prueba; una línea sin ningún > al  principio  se  considera\n       que  está  en  el nivel 0.  Cada línea en el nivel n+1 está bajo el control de la línea en el nivel n más\n       cercano que la preceda en el fichero mágico.  Si la prueba en una línea en el nivel  n  tiene  éxito,  se\n       realizan  las  pruebas  especificadas en todas las líneas subsiguientes en el nivel n+1 y se muestran los\n       mensajes si las pruebas tienen éxito. La línea siguiente en el nivel n termina con esto.   Si  el  primer\n       carácter  que  siga  al  último  >  es  un  ( entonces la cadena tras el paréntesis se interpreta como un\n       desplazamiento indirecto. Eso significa que el número tras el paréntesis se emplea como un desplazamiento\n       en  el  fichero. Se lee el valor en tal desplazamiento, y se emplea de nuevo como un desplazamiento en el\n       fichero. Los desplazamientos indirectos son de la forma: ((x[.[bslBSL]][+-][y]).  El valor de x se emplea\n       como  un  desplazamiento  en  el  fichero.  Se  lee  en  tal  sitio un byte, un entero corto o uno largo,\n       dependiendo del especificador de tipo [bslBSL].  Los tipos en mayúsculas interpretan el  número  como  un\n       valor  ascendente  hacia  la  derecha,  mientras  que  las  versiones  en  minúsculas lo interpretan como\n       ascendente hacia la izquierda. A ese número se le suma el valor de y y el resultado  se  emplea  como  un\n       desplazamiento en el fichero. El tipo predeterminado si no se especifica uno es long, un entero largo.\n\n       A  veces  uno no sabe la posición exacta puesto que ésta depende de la longitud de los campos anteriores.\n       Entonces se puede especificar un desplazamiento o posición relativa al final del último campo  del  nivel\n       superior  (por  supuesto esto sólo puede hacerse para pruebas en subniveles, como en las que empiezan con\n       >).  Tal desplazamiento relativo se especifica empleando & como prefijo del desplazamiento.\n\n", "FALLOS": "       Los formatos long, belong, lelong, short, beshort, leshort, date, bedate, y ledate son  dependientes  del\n       sistema;  quizás  deberían  especificarse como un número de bytes (2B, 4B, etc.), puesto que los ficheros\n       que se están reconociendo vienen normalmente de un sistema en el que las longitudes son invariantes.\n\n       No  hay  (actualmente)  soporte  para  que  se  empleen  datos  con  sexo  (endianess)  especificado   en\n       desplazamientos indirectos.\n\nVÉASE TAMBIÉN\n       file(1) - la orden que lee este fichero.\n\n                                                 Dominio Público                                        MAGIC(4)\n"},{"NOMBRE": "       mem, kmem, port - memoria del sistema, memoria del núcleo y puertos del sistema.\n\n", "DESCRIPCIÓN": "       mem  es  un  fichero de dispositivo de caracteres que representa a la memoria principal del ordenador. Se\n       puede utilizar, por ejemplo, para examinar (e incluso parchear) el sistema.\n\n       En mem, las direcciones de bytes se interpretan como direcciones físicas de memoria.  Las  referencias  a\n       posiciones no existentes producen un error.\n\n       El  examinar  y  parchear posiciones de memoria que contienen bits de sólo-lectura o sólo-escritura puede\n       conducir a resultados inesperados.\n\n       Normalmente se crea con:\n\n              mknod -m 660 /dev/mem c 1 1\n              chown root:mem /dev/mem\n\n       El archivo kmem es idéntico a mem, excepto que se accede a la memoria virtual del núcleo, en vez de a  la\n       memoria física.\n\n       Normalmente se crea con:\n\n              mknod -m 640 /dev/kmem c 1 2\n              chown root:mem /dev/kmem\n\n       port es similar a mem, pero se accede a los puertos de E/S.\n\n       Normalmente se crea con:\n\n              mknod -m 660 /dev/port c 1 4\n              chown root:mem /dev/port\n\n", "FICHEROS": "       /dev/mem\n       /dev/kmem\n       /dev/port\n\nVÉASE TAMBIÉN\n       mknod(1), chown(1), ioperm(2)\n\nLinux                                           21 Noviembre 1992                                         MEM(4)\n"},{"NOMBRE": "       mouse - Interfaz de ratón serie\n\n", "CONFIGURACIÓN": "       Los ratones serie se conectan a una línea serie RS232/V24, véase ttys(4) para una descripción.\n\n", "DESCRIPCIÓN": "   Introducción\n       El diagrama de conexión de un conector de 9 pines normal como el usado por un ratón serie es:\n\n                                          pin   nombre   usado para\n                                            2     RX     Data\n                                            3     TX     -12 V, Imax = 10 mA\n                                            4    DTR     +12 V, Imax = 10 mA\n                                            7    RTS     +12 V, Imax = 10 mA\n                                            5    GND     Ground\n\n       Esta es la especificación aunque, de hecho, 9 voltios son suficientes para la mayoría de los ratones.\n\n       El  driver del ratón puede reconocer un ratón poniendo la RTS a nivel bajo y subiéndola de nuevo. Después\n       de 14 ms el ratón enviará 0X4D ('M') en la línea de datos. Después de otros 63 ms, un ratón de 3  botones\n       Microsoft-compatible enviará 0x33 ('3').\n\n       El  movimiento  relativo  del ratón es enviado como dx (un valor positivio indica derecha) y dy (un valor\n       positivo indica abajo). Ratones diferentes pueden operar a diferentes velocidades. Para  seleccionar  una\n       velocidad,  entre  los valores 9600, 4800, 2400 y 1200 bit/s, se escriben los dos caracteres que aparecen\n       en la tabla de abajo y se hace una pausa de 0.1 segundos. La  siguiente  tabla  muestra  las  velocidades\n       disponibles y las cadenas que las seleccionan:\n\n                                                  bit/s   string\n                                                  9600    *q\n                                                  4800    *p\n                                                  2400    *o\n                                                  1200    *n\n\n       El primer byte de un paquete de datos se puede usar para propósitos de sincronización.\n\n   Protocolo Microsoft\n       El protocolo Microsoft usa 1 bit de inicio, 7 bits de datos, no paridad y un bit de parada a la velocidad\n       de 1200 bits/seg.  Los datos se envía a RxD en paquetes de 3 bytes.  Los movimientos dx y dy son enviados\n       en complemento a dos, y el bit lb (rb) se pone a 1 cuando se presiona el botón izquierdo (derecho):\n\n                                     byte   d6   d5    d4    d3    d2    d1    d0\n                                     ──────────────────────────────────────────────\n                                        1   1    lb    rb    dy7   dy6   dx7   dx6\n                                        2   0    dx5   dx4   dx3   dx2   dx1   dx0\n                                        3   0    dy5   dy4   dy3   dy2   dy1   dy0\n\n   Protocolo Microsoft de 3 botones\n       El  ratón original de Microsoft sólo tiene dos botones.  No obstante, hay algunos ratones de tres botones\n       que también usan el protocolo Microsoft.  Presionar o soltar el tercer botón (botón  central)  se  indica\n       enviando  un paquete de movimiento zero y ningún botón presionado.  (Por tanto, a diferencia de los otros\n       dos botones, el estado del tercer botón no se indica en cada paquete.)\n\n   Protocolo Logitech\n       Los ratones serie Logitech de 3 botones usan una extensión diferente del protocolo Microsoft:  cuando  el\n       botón  central  está  levantado,  se  envía  el paquete anterior de 3 bytes. Cuando el botón central está\n       pulsado, se envía un paquete de 4 bytes donde el 4º byte tiene el valor 0x20 (o, al menos,  tiene  activo\n       el  bit 0x20). En particular, la pulsación del botón central se indica como 0,0,0,0x20 cuando ningún otro\n       botón está pulsado.\n\n   Protocolo Mousesystems\n       El protocolo Mousesystems usa 1 bit de comienzo, 8 bits de datos, no paridad y dos bits de  parada  a  la\n       velocidad  de 1200 bits/seg.  Los datos se envian a RxD en paquetes de 5 bytes.  dx se envía como la suma\n       de los dos valores en complemento a dos, dy  se  envía  como  la  suma  negada  de  los  dos  valores  en\n       complemento a dos. El bit lb (mb, rb) se pone a 0 cuando se presiona el botón izquierdo(central,derecho):\n\n                              byte   d7    d6     d5     d4     d3     d2     d1     d0\n                              ───────────────────────────────────────────────────────────\n                                 1   1     0      0      0      0      lb     mb     rb\n                                 2   0    dxa6   dxa5   dxa4   dxa3   dxa2   dxa1   dxa0\n                                 3   0    dya6   dya5   dya4   dya3   dya2   dya1   dya0\n                                 4   0    dxb6   dxb5   dxb4   dxb3   dxb2   dxb1   dxb0\n                                 5   0    dyb6   dyb5   dyb4   dyb3   dyb2   dyb1   dyb0\n\n       Los bytes 4 y 5 describen el cambio producido desde que se transmitieron los bytes 2 y 3.\n\n   Protocolo Sun\n       El  protocolo  Sun es la versión de 3 bytes del protocolo anterior Mousesystems de 5 bytes: los últimos 2\n       bytes no se envían.\n\n   Protocolo MM\n       El protocolo MM usa 1 bit de comienzo, 8 bits de datos, paridad impar y un bit de parada a  la  velocidad\n       de 1200 bits/seg. Los datos se envían a RxD en paquetes de 3 bytes. dx y dy se envían como un único valor\n       con signo, donde el bit de signo indica un valor negativo. El bit lb (mb,  rb)  se  pone  a  1  cando  se\n       presiona el botón izquierdo (central, derecho):\n\n                                  byte   d7   d6    d5    d4    d3    d2    d1    d0\n                                  ────────────────────────────────────────────────────\n                                     1   1     0     0    dxs   dys   lb    mb    rb\n                                     2   0    dx6   dx5   dx4   dx3   dx2   dx1   dx0\n                                     3   0    dy6   dy5   dy4   dy3   dy2   dy1   dy0\n\n", "FICHEROS": "       /dev/mouse\n              un enlace simbolico frecuentemente usado, que apunta a un dispositivo de raton.\n\nVÉASE TAMBIÉN\n       ttys(4), gpm(8)\n\nLinux                                            10 Febrero 1996                                        MOUSE(4)\n"},{"NOMBRE": "       null, zero - sumidero de datos\n\n", "DESCRIPCIÓN": "       Los datos escritos en los ficheros especiales null o zero se desechan.\n\n       La lectura del fichero especial null siempre devuelve \"fin de fichero (EOF)\", mientras que la lectura del\n       fichero zero siempre devuelve el caracteres \\0 (NULL).\n\n       null y zero se crean normalmente con:\n\n              mknod -m 666 /dev/null c 1 3\n              mknod -m 666 /dev/zero c 1 5\n              chown root:mem /dev/null /dev/zero\n\n", "OBSERVACIONES": "       Si estos dos ficheros no tienen permiso de lectura y escritura para todos los usuarios, muchos  programas\n       se comportarán de manera extraña.\n\n", "FICHEROS": "       /dev/null\n       /dev/zero\n\nVÉASE TAMBIÉN\n       mknod(1), chown(1)\n\nLinux                                             30 Junio 1996                                          NULL(4)\n"},{"NOMBRE": "       mem, kmem, port - memoria del sistema, memoria del núcleo y puertos del sistema.\n\n", "DESCRIPCIÓN": "       mem  es  un  fichero de dispositivo de caracteres que representa a la memoria principal del ordenador. Se\n       puede utilizar, por ejemplo, para examinar (e incluso parchear) el sistema.\n\n       En mem, las direcciones de bytes se interpretan como direcciones físicas de memoria.  Las  referencias  a\n       posiciones no existentes producen un error.\n\n       El  examinar  y  parchear posiciones de memoria que contienen bits de sólo-lectura o sólo-escritura puede\n       conducir a resultados inesperados.\n\n       Normalmente se crea con:\n\n              mknod -m 660 /dev/mem c 1 1\n              chown root:mem /dev/mem\n\n       El archivo kmem es idéntico a mem, excepto que se accede a la memoria virtual del núcleo, en vez de a  la\n       memoria física.\n\n       Normalmente se crea con:\n\n              mknod -m 640 /dev/kmem c 1 2\n              chown root:mem /dev/kmem\n\n       port es similar a mem, pero se accede a los puertos de E/S.\n\n       Normalmente se crea con:\n\n              mknod -m 660 /dev/port c 1 4\n              chown root:mem /dev/port\n\n", "FICHEROS": "       /dev/mem\n       /dev/kmem\n       /dev/port\n\nVÉASE TAMBIÉN\n       mknod(1), chown(1), ioperm(2)\n\nLinux                                           21 Noviembre 1992                                         MEM(4)\n"},{"NOMBRE": "       ptmx y pts - pseudo-terminal maestra y esclava\n\n", "DESCRIPCIÓN": "       El  fichero  /dev/ptmx  es  un  dispositivo  de  caracteres  con  número mayor 5 y número menor 2, creado\n       normalmente con modo 0666 y de propietario root.root.  Se utiliza para crear un par de  pseudo-terminales\n       maestra y esclava.\n\n       Cuando  un  proceso  abre  /dev/ptmx,  obtiene  un descriptor de fichero para una pseudo-terminal maestra\n       (PTM), y se crea un dispositivo pseudo-terminal esclavo (PTS) en el directorio /dev/pts.  Cada descriptor\n       de  fichero  obtenido  al  abrir /dev/ptmx es una PTM independiente con su propia PTS asociada, cuya ruta\n       puede ser consultada pasando el descriptor a la función ptsname(3).\n\n       Antes de abrir la pseudo-terminal esclava, debe pasar el descriptor  de  fichero  de  la  pseudo-terminal\n       maestra a grantpt(3) y unlockpt(3).\n\n       Una  vez  que  la  pseudo-terminal  maestra  y  esclava  están abiertas, la pseudo-terminal esclava sirve\n       procesos con una interfaz idéntica a la de una terminal real.\n\n       Los datos escritos en el esclavo se presentan en el descriptor maestro como entrada.  Los datos  escritos\n       en el maestro se presentan en el esclavo como entrada.\n\n       En  la  práctica, las pseudo-terminales se usan para implementar emuladores de terminal como xterm(1), en\n       los cuales los datos leídos de la pseudo-terminal maestra son interpretados por la aplicación de la misma\n       forma  que  una  terminal  real  los  interpretaría,  y  para implementar programas de acceso remoto como\n       sshd(8), en los cuales los datos leídos de la pseudo-terminal esclava se envían a través  de  la  red  al\n       programa cliente que está conectado al terminal o emulador de terminal.\n\n       Las  pseudo-terminales se pueden emplear también para enviar la salida a los programas que normalmente se\n       niegan a leer la entrada de tuberías (como su(8), y passwd(8)).\n\n", "FICHEROS": "       /dev/ptmx, /dev/pts/*\n\n", "OBSERVACIONES": "       El soporte de Linux a todo lo anterior (conocido como sistema de nombres de pty's de Unix98)  se  realiza\n       usando el sistema de ficheros devpts, que debe montarse en /dev/pts.\n\n       Antes  de  este  esquema  de  Unix98,  las  pseudo-terminales maestras se llamaban /dev/ptyp0, ...  y las\n       esclavas /dev/ttyp0, ...  y era necesario tener ya creados y asignados  un  gran  número  de  nodos-i  de\n       dispositivo.\n\nVÉASE TAMBIÉN\n       getpt(3), grantpt(3), ptsname(3), unlockpt(3)\n\nLinux                                            9 octubre 2002                                           PTS(4)\n"},{"NOMBRE": "       ptmx y pts - pseudo-terminal maestra y esclava\n\n", "DESCRIPCIÓN": "       El  fichero  /dev/ptmx  es  un  dispositivo  de  caracteres  con  número mayor 5 y número menor 2, creado\n       normalmente con modo 0666 y de propietario root.root.  Se utiliza para crear un par de  pseudo-terminales\n       maestra y esclava.\n\n       Cuando  un  proceso  abre  /dev/ptmx,  obtiene  un descriptor de fichero para una pseudo-terminal maestra\n       (PTM), y se crea un dispositivo pseudo-terminal esclavo (PTS) en el directorio /dev/pts.  Cada descriptor\n       de  fichero  obtenido  al  abrir /dev/ptmx es una PTM independiente con su propia PTS asociada, cuya ruta\n       puede ser consultada pasando el descriptor a la función ptsname(3).\n\n       Antes de abrir la pseudo-terminal esclava, debe pasar el descriptor  de  fichero  de  la  pseudo-terminal\n       maestra a grantpt(3) y unlockpt(3).\n\n       Una  vez  que  la  pseudo-terminal  maestra  y  esclava  están abiertas, la pseudo-terminal esclava sirve\n       procesos con una interfaz idéntica a la de una terminal real.\n\n       Los datos escritos en el esclavo se presentan en el descriptor maestro como entrada.  Los datos  escritos\n       en el maestro se presentan en el esclavo como entrada.\n\n       En  la  práctica, las pseudo-terminales se usan para implementar emuladores de terminal como xterm(1), en\n       los cuales los datos leídos de la pseudo-terminal maestra son interpretados por la aplicación de la misma\n       forma  que  una  terminal  real  los  interpretaría,  y  para implementar programas de acceso remoto como\n       sshd(8), en los cuales los datos leídos de la pseudo-terminal esclava se envían a través  de  la  red  al\n       programa cliente que está conectado al terminal o emulador de terminal.\n\n       Las  pseudo-terminales se pueden emplear también para enviar la salida a los programas que normalmente se\n       niegan a leer la entrada de tuberías (como su(8), y passwd(8)).\n\n", "FICHEROS": "       /dev/ptmx, /dev/pts/*\n\n", "OBSERVACIONES": "       El soporte de Linux a todo lo anterior (conocido como sistema de nombres de pty's de Unix98)  se  realiza\n       usando el sistema de ficheros devpts, que debe montarse en /dev/pts.\n\n       Antes  de  este  esquema  de  Unix98,  las  pseudo-terminales maestras se llamaban /dev/ptyp0, ...  y las\n       esclavas /dev/ttyp0, ...  y era necesario tener ya creados y asignados  un  gran  número  de  nodos-i  de\n       dispositivo.\n\nVÉASE TAMBIÉN\n       getpt(3), grantpt(3), ptsname(3), unlockpt(3)\n\nLinux                                            9 octubre 2002                                           PTS(4)\n"},{"NOMBRE": "       ram - dispositivo de disco ram\n\n", "DESCRIPCIÓN": "       ram es el dispositivo de bloque usado para acceder al disco ram en modo crudo (raw mode).\n\n       Normalmente se crea con:\n\n              mknod -m 660 /dev/ram b 1 1\n              chown root:disk /dev/ram\n\n", "FICHEROS": "       /dev/ram\n\nVÉASE TAMBIÉN\n       mknod(1), chown(1), mount(8)\n\nLinux                                             30 Junio 1996                                           RAM(4)\n"},{"NOMBRE": "       random, srandom, initstate, setstate - generador de números aleatorios.\n\n", "SINOPSIS": "       #include <stdlib.h>\n\n       long int random(void);\n       void srandom(unsigned int seed);\n       char *initstate(unsigned int seed, char *state, size_t n);\n       char *setstate(char *state);\n\n", "DESCRIPCIÓN": "       La  función  random()  emplea  un generador no lineal aditivo con retroalimentación de números aleatorios\n       utilizando una tabla  predeterminada  de  31  enteros  largos  para  devolver  números  pseudo-aleatorios\n       sucesivos en el rango de 0 a RAND_MAX.  El periodo de este generador de números aleatorios es muy grande,\n       aproximadamente 16*((2**31)-1).\n\n       La función srandom() establece su argumento como la semilla de una  nueva  secuencia  de  enteros  seudo-\n       aleatorios  que serán devueltos por random() en secuencia.  Estas secuencias son repetibles si se llama a\n       srandom() con el mismo valor para la semilla. Si no se proporciona ninguna semilla, porque no se llama  a\n       srandom(), la función random() automáticamente asume una semilla de valor 1.\n\n       La  función  initstate()  permite  inicializar  un  vector  de  estado,  estado, para el uso por parte de\n       random().  El tamaño del vector de estado, n, es usado por initstate() para decidir cuán sofisticado debe\n       ser  el  generador de números aleatorios que debería usar: cuanto más grande sea el vector de estado, más\n       aleatorios serán los números. El argumento semilla es la semilla para la inicialización,  que  especifica\n       un  punto  de  arranque  para  la  secuencia de números aleatorios, y hace posible recomenzar en el mismo\n       punto.\n\n       La función setstate() cambia el vector de estado usado por la función random().   El  vector  de  estado,\n       estado,  se  usa  para  la  generación  de  números aleatorios hasta la siguiente llamada a initstate() o\n       setstate().  El argumento estado debe haber sido inicializado  primero  mediante  initstate()  o  ser  el\n       resultado de una llamada previa a setstate().\n\nVALOR DEVUELTO\n       La  función  random()  devuelve  un valor entre 0 y RAND_MAX.  La función srandom() no devuelve nada. Las\n       funciones initstate() y setstate() devuelven un puntero al vector de estado anterior, o NULL en  caso  de\n       error.\n\n", "ERRORES": "       EINVAL Se ha especificado un vector de estado de menos de 8 bytes para initstate().\n\n", "OBSERVACIONES": "       Los  valores  actuales \"óptimos\" para el tamaño del vector de estado, n, son 8, 32, 64, 128, y 256 bytes;\n       otras cantidades serán redondeadas por abajo hasta la cantidad conocida más cercana. Utilizar menos de  8\n       bytes producirá un error.\n\nCONFORME A\n       BSD 4.3\n\nVÉASE TAMBIÉN\n       rand(3), srand(3)\n\nGNU                                              20 agosto 2000                                        RANDOM(3)\n"},{"NOMBRE": "       sd - controlador para las unidades de disco SCSI\n\n", "SINOPSIS": "       #include <linux/hdreg.h> /* para HDIO_GETGEO */\n       #include <linux/fs.h>    /* para BLKGETSIZE y BLKRRPART */\n\n", "CONFIGURACIÓN": "       El  nombre  del dispositivo de bloque tiene la forma siguiente: sdlp ,donde l es una letra que designa la\n       unidad física, y p es un número que designa la partición en dicha unidad física. A menudo, el  número  de\n       partición, p, se omite cuando el dispositivo corresponde a la unidad entera.\n\n       Los  discos SCSI tienen un número mayor de dispositivo de 8, y un número menor de dispositivo de la forma\n       (16 * número_unidad) + número_partición, donde número_unidad es el número de la unidad  física  según  el\n       orden de detección, y número_partición se determina como sigue:\n\n       la partición 0 es la unidad entera\n       las particiones 1-4 son las particiones \"primarias\" DOS\n       las particiones 5-8 son las particiones \"extendidas\" (o \"lógicas\") DOS\n\n       Por  ejemplo, /dev/sda tiene el número mayor 8, menor 0, y se refiere a la primera unidad SCSI entera del\n       sistema. Y /dev/sdb3 tiene el número mayor 8, menor 19, y se refiere a la  tercera  partición  \"primaria\"\n       DOS de la segunda unidad SCSI del sistema.\n\n       En  este momento sólo están disponibles los dispositivos de bloque. Los dispositivos crudos (raw devices)\n       todavía no han sido implementados.\n\n", "DESCRIPCIÓN": "       Las siguientes ioctl() están disponibles:\n\n       HDIO_GETGEO\n              Devuelve los parámetros del disco de la BIOS, en la siguiente estructura:\n                     struct hd_geometry {\n                           unsigned char heads;    /*Número de cabezas*/\n                           unsigned char sectors;  /*Número de sectores*/\n                           unsigned short cylinders;    /*Número de cilindros*/\n                           unsigned long start;    /*Principio del disco*/\n                     };\n\n              Se pasa un puntero a esta estructura como el parámetro de ioctl(2).\n\n              La información devuelta en el parámetro es la geometría del disco de la unidad, ¡tal y como la  ve\n              el  DOS!   Esta  geometría  no  es  la geometría física de la unidad. No obstante, se utiliza para\n              construir la tabla de particiones de la unidad y es necesaria para el  adecuado  fucionamiento  de\n              fdisk(1),efdisk(1),  y lilo(1).  Si la información geométrica no está disponible, todos los campos\n              de la estructura son cero.\n\n       BLKGETSIZE\n              Devuelve el tamaño del dispositivo en sectores. El parámetro de ioctl(2) debe  ser  un  puntero  a\n              long.\n\n       BLKRRPART\n              Fuerza la relectura de la tabla de particiones del disco SCSI. No se necesita ningún parámetro.\n\n              También  se soportan las ioctl scsi(4).  Si se requiere el parámetro para ioctl(2) y éste es NULL,\n              entonces ioctl(2) devolverá -EINVAL.\n\n", "FICHEROS": "       /dev/sd[a-h]: el dispositivo completo\n       /dev/sd[a-h][0-8]: particiones de bloque individuales\n\nVÉASE TAMBIÉN\n       scsi(4)\n\nLinux                                             2 Julio 1996                                             SD(4)\n"},{"NOMBRE": "       st - dispositivo de cinta magnética SCSI\n\n", "SINOPSIS": "       #include <sys/mtio.h>\n\n       int ioctl(int fd, int request [, (void *)arg3]);\n       int ioctl(int fd, MTIOCTOP, (struct mtop *)mt_cmd);\n       int ioctl(int fd, MTIOCGET, (struct mtget *)mt_status);\n       int ioctl(int fd, MTIOCPOS, (struct mtpos *)mt_pos);\n\n", "DESCRIPCIÓN": "       El  manejador  (driver)  st  proporciona la interfaz para una variedad de dispositivos de cinta magnética\n       SCSI. Actualmente, toma el control de todos los dispositivos detectados de tipo “acceso secuencial”.   El\n       manejador st emplea el número mayor de dispositivo 9.\n\n       Cada  dispositivo  utiliza  ocho  números menores de dispositivo. Los cinco bits más bajos en los números\n       menores se asignan secuencialmente en el orden en que se detectan. Los números menores se pueden  agrupar\n       en  dos conjuntos de cuatro números: los números menores de dispositivo (con autorebobinado) principales,\n       n, y los números de dispositivo “sin rebobinado”, (n+128).  A los dispositivos abiertos que  utilicen  el\n       número  de  dispositivo  principal se les enviará una orden REWIND cuando se cierren.  A los dispositivos\n       abiertos que utilicen el número de dispositivo “sin rebobinado” no  se  les  enviará  esa  orden.   (Dese\n       cuenta  que  usar  un  dispositivo  con  autorebobinado  para posicionar la cinta con, por ejemplo, mt no\n       produce el resultado deseado: la cinta se rebobina después de la orden mt y la orden  siguiente  comienza\n       desde el principio de la cinta).\n\n       Dentro  de  cada  grupo,  hay disponibles cuatro números menores para definir dispositivos con diferentes\n       características (tamaño de bloque, compresión, densidad, etc.). Cuando  el  sistema  arranca,  sólo  está\n       disponible  el  primer  dispositivo.  Los  otros tres se activan cuando se definen las carcterísticas por\n       defecto (ver más abajo). (Cambiando las constantes en  tiempo  de  compilación,  es  posible  cambiar  el\n       equilibrio  entre  el número máximo de unidades de cinta y el número de números menores para cada unidad.\n       La asignación por defecto permite controlar 32 dispositivos de cinta. Por ejemplo, es  posible  controlar\n       hasta 64 unidades de cinta con 2 números menores para diferentes opciones).\n\n       Normalmente los dispositivos se crean con:\n              mknod -m 666 /dev/st0 c 9 0\n              mknod -m 666 /dev/st0l c 9 32\n              mknod -m 666 /dev/st0m c 9 64\n              mknod -m 666 /dev/st0a c 9 96\n              mknod -m 666 /dev/nst0 c 9 128\n              mknod -m 666 /dev/nst0l c 9 160\n              mknod -m 666 /dev/nst0m c 9 192\n              mknod -m 666 /dev/nst0a c 9 224\n\n       No existe el dispositivo de bloque correspondiente.\n\n       El  manejador  usa un buffer interno que tiene que ser lo suficientemente grande para contener, al menos,\n       un bloque de la cinta. En los núcleos anteriores  al  2.1.121,  el  buffer  se  reserva  como  un  bloque\n       contiguo. Esto limita el tamaño de bloque al mayor bloque contiguo de memoria que el código de asignación\n       de memoria del núcleo puede proporcionar. Actualmente, el límite es de 128KB  para  arquitecturas  de  32\n       bits  y  256KB  para  arquitecturas  de 64 bits. En núcleos posteriores el manejador reserva el buffer en\n       varias partes si es necesario. Por defecto, el número máximo de partes es de 16.  Esto significa  que  el\n       tamaño máximo de bloques es muy grande (2MB si es posible una asignación de 16 bloques de 128KB).\n\n       El  tamaño  del  buffer interno del manejador viene determinado por una contante en tiempo de compilación\n       que se puede alterar con una opción de inicio del núcleo.  Aparte de esto, el manejador intenta  reservar\n       un  buffer temporal mayor en tiempo de ejecución si es necesario. Sin embargo, la asignación en tiempo de\n       ejecución de grandes bloques contiguos de memoria puede fallar y es aconsejable no confiar  demasiado  en\n       la  asignación  dinámica  de buffers con núcleos anteriores al 2.1.121 (esto se aplica también a la carga\n       por demanda del manejador con kerneld o kmod).\n\n       El manejador no soporta específicamente ninguna marca o modelo de unidad de cinta. Después  del  arranque\n       del sistema se definen las opciones de los dispositivos de cinta a partir del firmware de la unidad.  Por\n       ejemplo, si el firmware de la unidad selecciona un modo de bloque fijo, el dispositivo de  cinta  usa  el\n       modo  de  bloque  fijo.  Las  opciones  se  pueden cambiar con llamadas explícitas a ioctl() y permanecen\n       activas cuando el dispositivo se cierra y se vuelve a abrir. La  configuración  de  las  opciones  afecta\n       tanto al dispositivo con auto-rebobinado como sin rebobinado.\n\n       Se  pueden  indicar diferentes opciones para los diferentes dispositos dentro del subgrupo de cuatro. Las\n       opciones entran en vigor cuando el dispositivo se abre. Por ejemplo, el administrador del  sistema  puede\n       definir  un  dispositivo  que  escribe en modo de bloque fijo con un tamaño de bloque concreto y otro que\n       escribe en modo de bloque variable (si la unidad de cinta soporta ambos modos).\n\n       El majenador soporta particiones de cinta  si  son  soportadas  por  la  unidad.  (Dese  cuenta  que  las\n       particiones de cinta no tienen nada que ver con las particiones de disco. Una cinta particionada se puede\n       ver como varias cintas lógicas dentro de un mismo medio). El soporte de particiones se debe habilitar con\n       ioctl.  La  posición  de  cinta se conserva dentro de cada partición durante los cambios de partición. La\n       partición usada para las operaciones de cinta  subsiguientes  se  selecciona  con  ioctl.  El  cambio  de\n       partición  se  ejecuta  junto  con  la  siguiente  operación  de  cinta  para evitar movimientos de cinta\n       innecesarios.  El número máximo de particiones en una cinta es definido por una constante  en  tiempo  de\n       compilación  (originalmente cuatro). El manejador contiene un ioctl que puede formatear una cinta con una\n       o dos particiones.\n\n       El dispositivo /dev/tape se crea normalmente como un enlace físico o simbólico al  dispositivo  de  cinta\n       predeterminado en el sistema.\n\nTRANSFERENCIA DE DATOS\n       El  manejador  soporta tanto el funcionamiento en modo de bloque fijo como en modo de bloque variable (si\n       la unidad lo soporta). En el modo de bloque fijo la unidad escribe bloques del tamaño especificado  y  el\n       tamaño  de  bloque no depende de la cantidad de bytes de las llamadas al sistema de escritura. En el modo\n       de bloque variable se escribe un bloque de cinta para cada llamada de escritura  y  el  número  de  bytes\n       determina  el  tamaño  del  bloque  de  cinta correspondiente. Dese cuenta que los bloques en la cinta no\n       contienen ninguna información sobre el modo de escritura: cuando se lee,  lo  único  importante  es  usar\n       órdenes que acepten los tamaños de los bloques en la cinta.\n\n       En el modo de bloque variable la cantida de bytes leídos no tiene que coincidir exactamente con el tamaño\n       de bloque de la cinta. Si la cantidad de bytes es mayor que el siguiente bloque de la cinta, el manejador\n       devuelve los datos y la función devuelve el tamaño real de bloque. Si el tamaño de bloque es mayor que la\n       cantidad de bytes, se devuelve la cantidad de datos solicitada desde el inicio del bloque y el resto  del\n       bloque se descarta.\n\n       En  el  modo  de  bloque  fijo, la cantidad de bytes a leer puede ser arbitraria si se habilita el uso de\n       buffers, o un múltiplo del tamaño de bloque de la cinta si se deshabilita el uso de buffers. Los  núcleos\n       anteriores  al  2.1.121  permiten escrituras con cantidades de bytes arbitrarias si se habilita el uso de\n       buffers. En todos los otros casos (un núcleo anterior al 2.1.121 con uso de buffers  deshabilitado  o  un\n       núcleo nuevo) la cantidad de bytes a escribir debe ser un múltiplo del tamaño de bloque de la cinta.\n\n       Automáticamente  se  escribe  una  marca  de fichero en la cinta si la última operación de cinta antes de\n       cerrar era un escritura.\n\n       Cuando se encuentra una marca de fichero durante las lecturas, ocurre lo siguiente. Si quedan datos en el\n       buffer  cuando  se  encuentra  la marca de fichero, se devuelven los datos del buffer. La próxima lectura\n       devuelve cero bytes. La siguiente lectura devuelve datos del siguiente fichero.  El final  de  los  datos\n       grabados  se indica devolviendo cero bytes para dos lecturas consecutivas. La tercera lectura devuelve un\n       error.\n\n", "IOCTLS": "       El manejador admite tres peticiones ioctl.  Las peticiones no reconocidas por el manejador st se pasan al\n       manejador SCSI.  Las definiciones de abajo son de /usr/include/linux/mtio.h:\n\n   MTIOCTOP - Efectuar una operación en la cinta\n       Esta  petición  toma  un argumento de tipo (struct mtop *).  No todas las unidades de cinta admiten todas\n       las operaciones.  El manejador retorna un error EIO si la unidad rechaza una operación.\n\n       /* Estructura para MTIOCTOP - orden de op. de cinta mag.: */\n       struct mtop {\n           short  mt_op;    /* operationes definidas abajo */\n           int    mt_count; /* cuántas de ellas */\n       };\n\n       Operaciones de Cinta Magnética para el uso normal de una cinta:\n       MTBSF         Espacio atrás sobre mt_count marcas de fichero.\n       MTBSFM        Espacio atrás sobre mt_count marcas de fichero.  Reposiciona la cinta a la parte EOT de  la\n                     última marca de fichero.\n       MTBSR         Espacio atrás sobre mt_count registros (bloques de cinta).\n       MTBSS         Espacio atrás sobre mt_count marcas de conjunto.\n       MTCOMPRESSION Habilita  la compresión de los datos de la cinta dentro de la unidad si mt_count no es cero\n                     y deshabilita la compresión si mt_count es cero. Esta orden usa el MODO  página  15  (`MODE\n                     page 15') soportado por la mayoría de DATs.\n       MTEOM         Ir al fin del material grabado (para añadir ficheros).\n       MTERASE       Borrar cinta.\n       MTFSF         Espacio atrás sobre mt_count marcas de fichero.\n       MTFSFM        Espacio  atrás sobre mt_count marcas de fichero.  Reposiciona la cinta a la parte BOT de la\n                     última marca de fichero.\n       MTFSR         Espacio atrás sobre mt_count registros (bloques de cinta).\n       MTFSS         Espacio atrás sobre mt_count marcas de conjunto.\n       MTLOAD        Ejecuta la orden SCSI de carga. Se dispone de un caso especial para algunos  autocargadores\n                     HP.  Si  mt_count es la constante MT_ST_HPLOADER_OFFSET más un número, el número se envia a\n                     la unidad para controlar al autocargador.\n       MTLOCK        Bloquea la puerta de la unidad de cinta.\n       MTMKPART      Formatea la cinta en una o dos particiones. Si mt_count no es cero,  da  el  tamaño  de  la\n                     primera  partición  y  la  segunda  partición contiene el resto de la cinta. Si mt_count es\n                     cero, la cinta se formatea en una partición.  Esta orden no está permitida para una  unidad\n                     a  menos que se habilite el soporte de particiones para la unidad (ver MT_ST_CAN_PARTITIONS\n                     más abajo).\n       MTNOP         No op. - vuelca el búfer del manejador como efecto colateral.  Debería emplearse  antes  de\n                     leer el estado con MTIOCGET.\n       MTOFFL        Rebobina y apaga la unidad.\n       MTRESET       Pone la unidad en el estado inicial.\n       MTRETEN       Retensiona la cinta.\n       MTREW         Rebobina.\n       MTSEEK        Busca  y va al número de bloque especificado en mt_count.  Esta operación requiere bien una\n                     unidad SCSI-2 que admita la orden LOCATE (dirección específica del dispositivo),  bien  una\n                     unidad  SCSI-1 compatible con Tandberg (Tandberg, Archive Viper, Wangtek, ... ).  El número\n                     de bloque debería ser uno previamente devuelto por  MTIOCPOS  si  se  utilizan  direcciones\n                     específicas del dispositivo.\n       MTSETBLK      Establece  la  longitud  de  bloque  de  la  unidad al valor especificado en mt_count.  Una\n                     longitud de bloque cero pone la unidad en modo de tamaño de bloque variable.\n       MTSETDENSITY  Pone la densidad de la cinta  según  el  código  en  mt_count.   Los  códigos  de  densidad\n                     soportados por una unidad se pueden encontrar en la documentación de la unidad.\n       MTSETPART     La  partición  activa  se cambia a mt_count .  Las particiones se numeran a partir de cero.\n                     Esta orden no se permite para una unidad a menos que se habilite el soporte de  particiones\n                     para la unidad (ver MT_ST_CAN_PARTITIONS más abajo).\n       MTUNLOAD      Ejecuta la orden SCSI de descarga (no expulsa la cinta).\n       MTUNLOCK      Desbloquea la puerta de la unidad de cinta.\n       MTWEOF        Escribe mt_count marcas de fichero.\n       MTWSM         Escribe mt_count marcas de conjunto.\n\n       Operaciones  de  Cinta  Magnética  para  configurar  las  opciones  del  dispositivo  (a  realizar por el\n       superusuario):\n       MTSETDRVBUFFER\n               Establece varias opciones de la unidad y el manejador según los  bits  codificados  en  mt_count.\n               Éstas  consisten  en el modo de uso de buffers de la unidad, 13 opciones booleanas del manejador,\n               el umbral de escritura del buffer, valores por defecto del tamaño  de  bloque  y  de  densidad  y\n               plazos de tiempo (sólo en núcleos >= 2.1).  Una única operación puede afectar a un único elemento\n               de la lista de debajo (los booleanos cuentan como un elemento).\n\n               Un valor que tenga ceros en los 4  bits  más  altos  se  empleará  para  establecer  el  modo  de\n               tamponamiento de la unidad.  Los modos de tamponamiento son:\n\n                   0   La  unidad  no informará del estado GOOD en órdenes de escritura hasta que los bloques de\n                       datos se escriban realmente en el material magnético.\n                   1   La unidad puede devolver un estado GOOD en órdenes de escritura tan pronto como todos los\n                       datos se hayan transferido al búfer interno de la unidad.\n                   2   La unidad puede devolver un estado GOOD en órdenes de escritura tan pronto como (a) todos\n                       los datos se hayan transferido al búfer interno del manejador, y (b) todos los  datos  en\n                       búferes,  provinientes de iniciadores diferentes, hayan sido bien escritos en el material\n                       magnético.\n\n               Para controlar  el  umbral  de  escritura,  el  valor  en  mt_count  debe  incluir  la  constante\n               MT_ST_WRITE_THRESHOLD  aplicándole el operador de bits O inclusivo con un número de bloque en los\n               28 bits de más bajo orden.  El número de bloque se refiere a bloques de 1024 bytes, no al  tamaño\n               de  bloque  físico  de  la  cinta.   El  umbral  no puede exceder el tamaño del búfer interno del\n               manejador (vea DESCRIPCIÓN, arriba).\n\n               Para activar y desactivar las opciones booleanas el valor en mt_count debe  incluir  una  de  las\n               constantes MT_ST_BOOLEANS, MT_ST_SETBOOLEANS, MT_ST_CLEARBOOLEANS o MT_ST_BOOLEANS operada con un\n               O lógico inclusivo a nivel de bits con cualquier combinación de las siguientes opciones, según se\n               desee.   Usando MT_ST_BOOLEANS se pueden asignar a las opciones los valores definidos en los bits\n               correspondientes. Con MT_ST_SETBOOLEANS se pueden configurar las opciones de  forma  selectiva  y\n               selectivamente borradas con MT_ST_DEFBOOLEANS.\n\n               Las  opciones  por  defecto  para un dispositivo de cinta se configuran con MT_ST_DEFBOOLEANS. Un\n               dispositivo de cinta no activo (por ejemplo, un dispositivo con número menor 32 o 160) se  activa\n               cuando  sus  opciones por defecto se definen por primera vez. Un dispositivo activado herenda del\n               dispositivo activado durante el arranque las opciones no configuradas explícitamente.\n\n               Las opciones booleanas son:\n\n               MT_ST_BUFFER_WRITES  (Por omisión: verdad)\n                      Todas las operaciones de escritura van a través de búferes en el modo de bloque fijo.   Si\n                      esta  opción  es  falsa  y  la  unidad emplea un tamaño de bloque fijo, entonces todas las\n                      operaciones de escritura deben ser un múltiplo del tamaño  de  bloque.  Esta  opción  debe\n                      ponerse como falsa para escribir confiablemente archivos multivolúmenes.\n               MT_ST_ASYNC_WRITES  (Por omisión: verdad)\n                      Cuando  esta  opción  es  verdad, las operaciones de escritura regresan inmediatamente sin\n                      esperar que los datos se transfieran a la unidad si  los  datos  caben  en  el  búfer  del\n                      manejador.   El  umbral de escritura determina cuán lleno debe estar el búfer antes de que\n                      se dé una nueva orden de escritura SCSI.   Cualquier  error  devuelto  por  la  unidad  se\n                      mantendrá  en  espera  hasta  la siguiente operación.  Esta opción debe ponerse como falsa\n                      para escribir confiablemente archivos multivolúmenes.\n               MT_ST_READ_AHEAD  (Por omisión: verdad)\n                      Esta opción hace que el manejador proporcione un búfer para  la  lectura,  y  lectura  por\n                      adelantado  en  el  modo  de  bloque  fijo.  Si esta opción es falsa y la unidad emplea un\n                      tamaño de bloque fijo, entonces todas  las  operaciones  de  lectura  deben  ser  para  un\n                      múltiplo del tamaño de bloque.\n               MT_ST_TWO_FM  (Por omisión: falso)\n                      Esta  opción  modifica  el  comportamiento  del  manejador cuando un fichero se cierra. La\n                      acción normal es escribir una simlpe marca de fichero. Si la opción es verdad el manejador\n                      escribirá dos marcas de fichero y hará un espacio atrás sobre el segundo.\n\n                      Nota:  Esta  opción  no debería ponerse a verdad para unidades de cinta QIC puesto que son\n                      incapaces de sobreescribir una marca de fichero.  Estas unidades detectan el fin de  datos\n                      grabados  mirando  si hay cinta en blanco en vez de dos marcas de fichero consecutivas. La\n                      mayoría de las otras unidades actuales también detectan el final de los datos  grabados  y\n                      el  uso  de dos marcas de fichero es normalmente necesario sólo al intercambiar cintas con\n                      algunos otros sistemas.\n\n               MT_ST_DEBUGGING  (Por omisión: falso)\n                      Esta opción activa varios mensajes de depuración del manejador (sólo  es  efectiva  si  se\n                      compiló la unidad con DEBUG definida a un valor no cero).\n               MT_ST_FAST_EOM  (Por omisión: falso)\n                      Esta  opción  hace  que  la  operación MTEOM se envíe directamente a la unidad, acelerando\n                      potencialmente la operación pero haciendo que el manejador pierda la pista del  número  de\n                      fichero  en  curso  normalmente  devuelto  por la petición MTIOCGET.  Si MT_ST_FAST_EOM es\n                      falso el manejador responderá a una petición  MTEOM  saltando  hacia  adelante  sobre  los\n                      ficheros.\n               MT_ST_AUTO_LOCK (Por omisión: falso)\n                      Cuando  esta  opción  es  verdad,  la  puerta  de  la  unidad se bloquea cuando se abre el\n                      dispositivo y se desbloquea cuando se cierra.\n               MT_ST_DEF_WRITES (Por omisión: falso)\n                      Las opciones de cinta (tamaño de bloque, modo, compresión, etc.) pueden cambiar al cambiar\n                      de  un  dispositivo  ligado  a  una  unidad  a  otro  dispositivo ligado a la misma unidad\n                      dependiendo de cómo se  definan  los  dispositivos.   Esta  opción  define  cuándo  es  el\n                      manejador  el  que  fuerza  los  cambios  usando  órdenes  SCSI  y cúando se confía en las\n                      capacidades del autodetección de las unidades. Si esta opción es falsa, el manejador envía\n                      inmediatamente órdenes SCSI cuando se cambia el dispositivo. Si la opción es verdad, no se\n                      envían órdenes SCSI hasta que se solicite una  escritura.  En  este  caso  se  permite  al\n                      firmware  de  la  unidad  detectar  la  estructura  de la cinta al leer y sólo se usan las\n                      órdenes SCSI para asegurarse de que una cinta se escribe según la especificación correcta.\n               MT_ST_CAN_BSR (Por omisión: falso)\n                      Algunas veces, cuando se usa lectura por adelantado,  se  debe  retrocer  la  cinta  a  la\n                      posición  correcta  cuando  se cierra el dispositivo y, para este propósito, se utiliza la\n                      orden SCSI para retrocer sobre los registros. Algunas  unidades  más  antiguas  no  pueden\n                      procesar  esta orden de manera fiable y se puede usar esta opción para mandar al manejador\n                      no usar la orden. El resultado final es que, con lectura  por  adelantado  y  el  modo  de\n                      bloque  fijo,  la  cinta  podría  no  estar correctamente posicionada dentro de un fichero\n                      cuando el dispositivo se cierra.\n               MT_ST_NO_BLKLIMS (Por omisión: falso)\n                      Algunas unidades no aceptan la orden SCSI READ BLOCK LIMITS. Si se usa esto, el  manejador\n                      no usará la orden. El inconveniente es que el manejador no puede comprobar antes de enviar\n                      órdenes si el tamaño de bloque seleccionado es aceptable por la unidad.\n               MT_ST_CAN_PARTITIONS (Por omisión: falso)\n                      Esta opción habilita el soporte de varias particiones dentro de una cinta.  La  opción  se\n                      aplica a todos los dispositivos ligados a la unidad.\n               MT_ST_SCSI2LOGICAL (Default: false)\n                      Esta  opción obliga al manejador a usar las direcciones lógicas de bloques definidas en el\n                      estándar SCSI-2 al realizar la búsqueda y comunicar operaciones (tanto con la órden MTSEEK\n                      como  con  MTIOCPOS  y  al  cambiar  la  partición de la cinta). En otro caso, se usan las\n                      direcciones específicas del dispositivo. Es muy recomendable activar  esta  opción  si  la\n                      unidad  soporta  direcciones lógicas ya que también cuentan marcas de fichero. Hay algunos\n                      dispositivos que sólo soportan direcciones lógicas de bloque.\n               MT_ST_SYSV (Por omisión: falso)\n                      Cuando se habilita esta opción, los dispositivos de cinta usan la semántica de SystemV. En\n                      caso  contrario,  se  usa  la  semántica  BSD.  La  diferencia  más importante entre ambas\n                      semánticas es qué ocurre cuando un dispositivo utilizado para lectura  se  cierra:  en  la\n                      semántica  SYSV la cinta se avanza hasta pasar la siguiente marca de fichero si esto no ha\n                      ocurrido ya al usar el dispositivo. En la semántica BSD la posición de la cinta no cambia.\n               EJEMPLO\n                      struct mtop mt_cmd;\n                      mt_cmd.mt_op = MTSETDRVBUFFER;\n                      mt_cmd.mt_count = MT_ST_BOOLEANS |\n                                 MT_ST_BUFFER_WRITES |\n                                 MT_ST_ASYNC_WRITES;\n                      ioctl(fd, MTIOCTOP, &mt_cmd);\n\n               El tamaño de bloque por defecto para un dispositivo se puede configurar con  MT_ST_DEF_BLKSIZE  y\n               el  código de densidad por defecto se puede configurar con MT_ST_DEFDENSITY. Los valores para los\n               parámetros se operan con un O lógico con el código de operación.\n\n               Con los núcleos 2.1.x y posteriores, los valores de los plazos  de  tiempo  (timeout)  se  pueden\n               configurar  con  la  suborden MT_ST_SET_TIMEOUT operado con un O lógico con el plazo de tiempo en\n               segundos.  El plazo largo de tiempo (usado para los rebobinados y otras órdenes que pueden tardar\n               mucho  tiempo) se puede configurar con MT_ST_SET_LONG_TIMEOUT. Los valores por defecto del núcleo\n               son muy grandes para asegurarse de que una órden exitosa no será cancelada para  ninguna  unidad.\n               Debido a esto, el manejador puede parecer atascado aun cuando sólo esté esperando a que se cumpla\n               el plazo de tiempo. Estas órdenes se pueden usar para configurar  más  valores  útiles  para  una\n               unidad  específica.  Los  plazos de tiempo configurados para un dispostivo se aplican a todos los\n               dispositivos ligados a la misma unidad.\n\n   MTIOCGET - Obtiene el estado\n       Esta petición toma un argumento de tipo (struct mtget *).\n\n       /* estructura para MTIOCGET - orden estado de cinta mag */\n       struct mtget {\n           long   mt_type;\n           long   mt_resid;\n           /* los ss. registros son dependientes del dispositivo */\n           long   mt_dsreg;\n           long   mt_gstat;\n           long   mt_erreg;\n           /* Los ss. 2 campos no se usan siempre */\n           daddr_t          mt_fileno;\n           daddr_t          mt_blkno;\n       };\n\n       mt_type    El fichero de cabecera define muchos valores para mt_type, pero el  manejador  actual  informa\n                  sólo  de  los  tipos genéricos MT_ISSCSI1 (cinta genérica SCSI-1) y MT_ISSCSI2 (cinta genérica\n                  SCSI-2).\n       mt_resid   contiene el número de partición actual de la cinta.\n       mt_dsreg   informa de los valores actuales de la unidad para el tamaño de bloque  (en  los  24  bits  más\n                  bajos)  y  para  la  densidad  (en  los  8  bits más altos).  Estos campos están definidos por\n                  MT_ST_BLKSIZE_SHIFT, MT_ST_BLKSIZE_MASK, MT_ST_DENSITY_SHIFT, y MT_ST_DENSITY_MASK.\n       mt_gstat   da información de estado genérica (independiente del dispositivo).   El  fichero  de  cabecera\n                  define macros para comprobar estos bits de estado:\n                  GMT_EOF(x):  La cinta está posicionada justo tras una marca de fichero (siempre falso tras una\n                      operación MTSEEK).\n                  GMT_BOT(x): La cinta está posicionada al principio del primer fichero (siempre falso tras  una\n                      operación MTSEEK).\n                  GMT_EOT(x): Una operación de cinta ha alcanzado el Final de Cinta físico.\n                  GMT_SM(x):  La cinta está posicionada actualmente en una marca de conjunto (siempre falso tras\n                      una operación MTSEEK).\n                  GMT_EOD(x): La cinta está posicionada al final de datos grabados.\n                  GMT_WR_PROT(x): La unidad está protegida de escritura.  Para  algunas  unidades  esto  también\n                      puede significar que no admite escribir en el tipo de medio físico actual.\n                  GMT_ONLINE(x):  El  último  open()  encontró  a la unidad con una cinta puesta y lista para la\n                      operación.\n                  GMT_D_6250(x), GMT_D_1600(x), GMT_D_800(x): Esta información de estado “genérica”  informa  de\n                      la densidad actual para unidades de cinta de 9 pistas y ½ in. solamente.\n                  GMT_DR_OPEN(x): La unidad no tiene una cinta puesta.\n                  GMT_IM_REP_EN(x): Modo de informe inmediato. Este bit se activa si no hay garantías de que los\n                      datos se hayan escrito físicamente en la cinta cuando la llamada de escritura termina.  Se\n                      le asigna el valor cero sólo cuando el manejador no usa buffers para los datos y la unidad\n                      no está configurada para usar buffers de datos.\n       mt_erreg   El único campo definido en mt_erreg es el número de errores recuperados en los 16 bits de  más\n                  bajo   orden  (como  se  define  por  MT_ST_SOFTERR_SHIFT  y  MT_ST_SOFTERR_MASK).   Debido  a\n                  inconsistencias en la forma en que las unidades informan de errores recuperados, este número a\n                  menudo  no es mantenido (la mayoría de las unidades no informan, por defecto, de errores leves\n                  pero esto se puede cambiar con una orden SCSI MODE SELECT).\n       mt_fileno  devuelve el número de fichero actual (empezando por cero).  Este valor se pone a -1 cuando  el\n                  número de fichero se desconoce (p. ej. después de MTBSS o MTSEEK).\n       mt_blkno   da  el  número de bloque (empezando por cero) dentro del fichero actual.  Este valor se pone a\n                  -1 cuando el número de bloque se desconoce (p. ej. después de MTBSF, MTBSS, o MTSEEK).\n\n   MTIOCPOS - Obtener la posición en la cinta\n       Esta petición toma un argumento de tipo (struct mtpos *) y devuelve la noción que tiene el manejador  del\n       número  de  bloque  de  cinta actual, que no es el mismo que mt_blkno devuelto por MTIOCGET.  Esta unidad\n       debe ser de tipo SCSI-2 y debe admitir la orden READ POSITION (dirección específica  del  dispositivo)  o\n       una unidad SCSI-1 compatible Tandberg (Tandberg, Archive Viper, Wangtek, ... ).\n\n       /* estructura para MTIOCPOS - orden obtener posición cinta mag. */\n       struct     mtpos {\n           long   mt_blkno; /* número de bloque en curso */\n       };\n\nVALOR DEVUELTO\n       EIO           La operación pedida no ha podido completarse.\n\n       ENOSPC        Una  operación de escritura no pudo completarse porque la cinta llegó al final del material\n                     magnético.\n\n       EACCES        Se intentó escribir o borrar una cinta protegida para escritura.  (Este error no se detecta\n                     durante open().)\n\n       EFAULT        Los parámetros de la orden apuntan a memoria que no pertenece al proceso invocador.\n\n       ENXIO         Durante la apertura, el dispositivo de cinta no existe.\n\n       EBUSY         El dispositivo ya está en uso o el manejador ha sido incapaz de reservar un búfer.\n\n       EOVERFLOW     Se  ha  intentado  leer o escribir un bloque de longitud variable que es mayor que el búfer\n                     interno del manejador.\n\n       EINVAL        Una llamada a ioctl() tenía un argumento incorrecto, o  un  tamaño  de  bloque  pedido  era\n                     ilegal.\n\n       ENOSYS        ioctl() desconocido.\n\n       EROFS         Se  ha  intentado realizar una operación `open' con O_WRONLY o O_RDWR cuando la cinta de la\n                     unidad está protegida contra escritura.\n\n", "FICHEROS": "       /dev/st*  : dispositivos de cinta SCSI con autorebobinado\n       /dev/nst* : dispositivos de cinta SCSI sin rebobinado\n\n", "AUTOR": "       El manejador ha sido escrito por by Kai Mäkisara (Kai.Makisara@metla.fi) a partir del  manejador  escrito\n       por Dwayne Forsyth. Varias otras personas también han contribuido al manejador.\n\nVÉASE TAMBIÉN\n       mt(1)\n\n       El  fichero  README.st de los fuentes del núcleo contiene la información más reciente del manejador y sus\n       posibilidades de configuración.\n\n", "OBSERVACIONES": "       1. Cuando se intercambian datos entre sistemas, ambos sistemas deben coincidir en el  tamaño  físico  del\n       bloque  de la cinta. Los parámetros de una unidad después del arranque no son, con frecuencia, los que la\n       mayoría de los sistemas operativos usan con estos dispositivos. La mayoría de los sistemas usan  unidades\n       en  modo de bloque variable si la unidad soporta ese modo. Esto es aplicable a la mayoría de las unidades\n       modernas, incluyendo DATs, unidades de recorrido helicoidal de 8mm, DLTs, etc. Puede ser aconsejable usar\n       estas unidades en modo variable también en Linux (es decir, use MTSETBLK o MTSETDEFBLK en el arranque del\n       sistema para establecer el modo), al menos  cuando  se  intercambien  datos  con  sistemas  externos.  El\n       inconveniente  de esto es que se debe usar un tamaño de bloque de cinta bastante largo para obtener tasas\n       de transferencia de datos aceptables sobre el bus SCSI.  2. Muchos programas (por ejemplo, tar)  permiten\n       al  usuario  especificar  el  tamaño  de bloque en la línea de órdenes. Dese cuenta que esto determina el\n       tamaño físico del bloque en la cinta sólo en el modo de bloque variable.\n\n       3. Para usar unidades de cinta SCSI, el manejador básico de SCSI, el manejador de un adaptador SCSI y  el\n       manejador  de  cintas SCSI deben estar bien configurados dentro del núcleo o cargados como módulos. Si el\n       manejador de cintas SCSI no está presente, se reconoce la unidad pero el soporte  de  cinta  descrito  en\n       esta página no está disponible.\n\n       4.  El manejador escribe los mensajes de error a la consola/registro(log).  Los códigos SENSE escritos en\n       algunos mensajes se traducen automática a texto si se han habilitado en la configuración del  núcleo  los\n       mensajes SCSI prolijos.\n\n", "COPYRIGHT": "       Copyright © 1995 Robert K. Nichols.\n       Copyright © 1999 Kai Mäkisara.\n\n       Se da permiso para hacer y distribuir copias idénticas de este manual supuesto que la nota de copyright y\n       ésta de permiso se preservan en todas las copias.  El fichero de  cabecera  del  código  fuente  contiene\n       permisos adicionales.\n\nLinux 2.0 - 2.2                                   18 enero 1999                                            ST(4)\n"},{"NOMBRE": "       tty - imprime el nombre del fichero del terminal conectado a la entrada estándar\n\n", "SINOPSIS": "       tty [-s] [--silent] [--quiet] [--help] [--version]\n\n", "DESCRIPCIÓN": "       Esta  documentación  no  va  a  ser  mantenida  a  partir  de ahora y puede ser inexacta o incompleta. La\n       documentación Texinfo es ahora la fuente autorizada.\n\n       Esta página de manual documenta la versión de GNU de tty.  tty imprime el  nombre  del  fichero  del  tty\n       conectado a su entrada estándar.  Imprime `not a tty' si la entrada estándar no es una tty. Acaba con los\n       siguientes valores:\n       0 si la entrada estándar es una tty\n       1 si la entrada estándar no es una tty\n       2 si se le dieron argumentos incorrectos\n       3 si ocurrieron errores de escritura\n\n   OPCIONES\n       --help Imprime un mensaje del uso por la salida estándar y termina satisfactoriamente.\n\n       -s, --silent, --quiet\n              No imprime nada; solo retorna un valor de terminación correcta.\n\n       --version\n              Imprime información sobre la versión por la salida estándar y termina satisfactoriamente.\n\nFSF                                          Utilidades Shell de GNU                                      TTY(1)\n"},{"NOMBRE": "       tty ioctl - ioctls para terminales y líneas serie\n\n", "SINOPSIS": "       #include <termios.h>\n\n       int ioctl(int fd, int cmd, ...);\n\n", "DESCRIPCIÓN": "       La llamada ioctl() para terminales y puertos serie acepta muchas órdenes que se pasan como argumentos. La\n       mayoría necesita un tercer argumento, de tipo variable, que aquí llamamos argp o arg.\n\n       El uso de ioctl hace que un programa no sea (trans)portable. Use la interfaz POSIX descrita en termios(3)\n       siempre que sea posible.\n\n   Obtener y establecer los atributos de un terminal\n       TCGETS    struct termios *argp\n              Equivalente a tcgetattr(fd, argp).\n              Obtiene la configuración actual de un puerto serie.\n\n       TCSETS    const struct termios *argp\n              Equivalente a tcsetattr(fd, TCSANOW, argp).\n              Establece la configuración actual de un puerto serie.\n\n       TCSETSW   const struct termios *argp\n              Equivalente a tcsetattr(fd, TCSADRAIN, argp).\n              Permite vaciar el buffer de salida y establecer la configuración actual de un puerto serie.\n\n       TCSETSF   const struct termios *argp\n              Equivalente a tcsetattr(fd, TCSAFLUSH, argp).\n              Permite  vaciar  el buffer de salida, descartar la entrada pendiente y establecer la configuración\n              actual de un puerto serie.\n\n       Las siguientes cuatro ioctls son exactamente iguales a TCGETS, TCSETS, TCSETSW y TCSETSF, excepto en  que\n       toman un argumento struct termio * en lugar de un argumento struct termios *.\n\n       TCGETA    struct termio *argp\n\n       TCSETA    const struct termio *argp\n\n       TCSETAW   const struct termio *argp\n\n       TCSETAF   const struct termio *argp\n\n   Bloqueo de una estructura termios\n       La estructura termios de un tty se puede bloquear. El propio bloqueo es una estructura termios con bits o\n       campos distintos de cero indicando un valor bloqueado.\n\n       TIOCGLCKTRMIOS struct termios *argp\n              Obtiene el estado de bloqueo de la estructura termios del terminal.\n\n       TIOCSLCKTRMIOS const struct termios *argp\n              Establece el estado de bloqueo de la estructura termios del terminal. Sólo el  superusuario  puede\n              hacer esto.\n\n   Obtener y establecer el tamaño de la ventana\n       Los  tamaños  de  las  ventanas  se  guardan en el núcleo pero éste no los usa (excepto en el caso de las\n       consolas virtuales, donde el núcleo actualizará el tamaño de la ventana cuando el tamaño  de  la  consola\n       virtual cambie, por ejemplo, al cargar una nueva fuente).\n\n       TIOCGWINSZ     struct winsize *argp\n              Obtiene el tamaño de la ventana.\n\n       TIOCSWINSZ     const struct winsize *argp\n              Establece el tamaño de la ventana.\n\n       La estructura usada por estas ioctls se define como\n\n       struct winsize {\n               unsigned short ws_row;\n               unsigned short ws_col;\n               unsigned short ws_xpixel;   /* sin usar */\n               unsigned short ws_ypixel;   /* sin usar */\n       };\n\n       Cuando el tamaño de la ventana cambia, se envía una señal SIGWINCH al grupo de procesos en primer plano.\n\n   Envío de una pausa (break)\n       TCSBRK    int arg\n              Equivalente a tcsendbreak(fd, arg).\n              Si la termina usa una transmisión asíncrona serie de datos y si el argumento arg es cero, entonces\n              envía una pausa (un flujo de bits a cero) con una duración de entre 0'25 y  0'5  segundos.  Si  el\n              terminal  no  usa  una  transmisión  asíncrona  serie de datos, entonces o se envía una pausa o la\n              función regresa sin hacer nada.  Cuando arg no es cero, nadie sabe qué ocurrirá.\n\n              (SVR4, UnixWare, Solaris y Linux tratan tcsendbreak(fd,arg) como tcdrain(fd) cuando  el  argumento\n              arg  es distinto de cero. SunOS trata arg como un multiplicador y envía arg veces un flujo de bits\n              tan largo como el que se envía para un valor de arg igual a  cero.   DG-UX  y  AIX  tratan  a  arg\n              (cuando no es cero) como un intervalo de tiempo medido en milisegundos.  HP-UX ignora arg.)\n\n       TCSBRKP   int arg\n              Conocida  como  la  \"versión  POSIX\" de TCSBRK. Trata un arg distinto de cero como un intervalo de\n              tiempo medido en décimas de segundo y no hace nada cuando el driver no soporta pausas.\n\n       TIOCSBRK  void\n              Activa la pausa, es decir, empieza a enviar bits a cero.\n\n       TIOCCBRK  void\n              Desactiva la pausa, es decir, deja de enviar bits a cero.\n\n   Control de flujo software\n       TCXONC    int arg\n              Equivalente a tcflow(fd, arg).\n              Vea tcflow(3) para los valores de argumento TCOOFF, TCOON, TCIOFF y TCION.\n\n   Escrutinio y vaciado de buffers\n       FIONREAD  int *argp\n              Obtiene el número de bytes en el buffer de entrada.\n\n       TIOCINQ   int *argp\n              Igual que FIONREAD.\n\n       TIOCOUTQ  int *argp\n              Obtienen el número de bytes en el buffer de salida.\n\n       TCFLSH    int arg\n              Equivalente a tcflush(fd, arg).\n              Vea tcflush(3) para los valores de argumento TCIFLUSH, TCOFLUSH y TCIOFLUSH.\n\n   Falsificación de la entrada\n       TIOCSTI   const char *argp\n              Inserta el byte dado en la cola de entrada.\n\n   Redirección de la salida de consola\n       TIOCCONS  void\n              Redirecciona la salida que habría ido a /dev/console o /dev/tty0 al tty dado. Si éste  es  un  pty\n              maestro,  envía  la  salida  a la parte esclava. Cualquier usuario puede hacer esto siempre que la\n              salida no haya sido ya redireccionada. Si ya fue  redireccionada,  se  devuelve  el  valor  EBUSY,\n              aunque  el  root  puede detener la redirección usando esta ioctl con fd apuntando a /dev/console o\n              /dev/tty0.\n\n   tty controlador\n       TIOCSCTTY int arg\n              Convierte al tty dado en el tty controlador del proceso actual. El  proceso  actual  debe  ser  un\n              líder de sesión y no tener ya un tty controlador. Si este tty es ya el tty controlador de un grupo\n              de sesión diferente entonces la llamada a ioctl falla con EPERM, a menos que el invocador  sea  el\n              root  y  arg  valga  1,  en cuyo caso se `roba' el tty y todos los procesos que lo tenían como tty\n              controlador lo pierden.\n\n       TIOCNOTTY void\n              Si el tty dado fuera el tty controlador del proceso actual, se abandona este tty  controlador.  Si\n              el  proceso  fuera  el líder de sesión, entonces se envía SIGHUP y SIGCONT al grupo de procesos en\n              primer plano y todos los procesos en la sesión actual pierden sus ttys controladores.\n\n   (Número) identificador (ID) de grupo de procesos y sesión\n       TIOCGPGRP pid_t *argp\n              Cuando tiene éxito, equivale a *argp = tcgetpgrp(fd).\n              Obtiene el ID del grupo de procesos en primer plano en este tty.\n\n       TIOCSPGRP const pid_t *argp\n              Equivalente a tcsetpgrp(fd, *argp).\n              Establece el ID del grupo de procesos en primer plano de este tty.\n\n       TIOCGSID  pid_t *argp\n              Obtiene el ID de sesión del tty dado. La llamada fallará con ENOTTY en el caso en el que el tty no\n              sea un pty maestro ni nuestro tty controlador. Raro.\n\n   Modo exclusivo\n       TIOCEXCL  void\n              Coloca  el tty en modo exclusivo.  No se permiten más operaciones open(2) sobre el terminal (éstas\n              fallarán con EBUSY excepto para el root).\n\n       TIOCNXCL  void\n              Desactiva el modo exclusivo.\n\n   Disciplina de línea\n       TIOCGETD  int *argp\n              Obtiene la disciplina de línea del tty.\n\n       TIOCSETD  const int *argp\n              Establece la disciplina de línea del tty.\n\n   Ioctls de los pseudo-tty\n       TIOCPKT   const int *argp\n              Activa (cuando *argp no es cero) o desactiva el modo de paquetes. Sólo se puede aplicar a la parte\n              maestra  de un pseudo-tty (y devolverá ENOTTY en otro caso).  En el modo de paquetes, cada read(2)\n              posterior devolverá un paquete que contiene o bien un único byte de control  distinto  de  cero  o\n              bien un único byte a 0 seguido de datos escritos en la parte esclava del pty. Si el primer byte no\n              es TIOCPKT_DATA (0), entonces es un O-lógico de uno o más de los siguientes bits:\n\n              TIOCPKT_FLUSHREAD   La cola de lectura del terminal está vacía.\n              TIOCPKT_FLUSHWRITE  La cola de escritura del terminal está vacía.\n              TIOCPKT_STOP        Se para la salida del terminal.\n              TIOCPKT_START       Se reinicia la salida del terminal.\n              TIOCPKT_DOSTOP      t_stopc es `^S' y t_startc es `^Q'.\n              TIOCPKT_NOSTOP      los caracteres de inicio y parada no son `^S/^Q'.\n\n              Mientras se use este modo, se puede detectar la presencia de datos de entrada en la parte  maestra\n              del pty mediante una llamada a select(2).  Dichos datos contienen información de estado de control\n              para condiciones excepcionales.\n\n              Este modo lo usan rlogin(1) y rlogind(8) para implementar un login remoto con un flujo  controlado\n              localmente mediante `^S/^Q' y un eco remoto.\n\n              Las ioctls de BSD TIOCSTOP, TIOCSTART, TIOCUCNTL, TIOCREMOTE no se han implementado en Linux.\n\n   Control del modem\n       TIOCMGET  int *argp\n              Obtiene el estado de los bits del modem.\n\n       TIOCMSET  const int *argp\n              Configura el estado de los bits del modem.\n\n       TIOCMBIC  const int *argp\n              Borra los bits del modem que se indican.\n\n       TIOCMBIS  const int *argp\n              Activa los bits del modem que se indican.\n\n       Los bits usados para estas cuatro ioctls son:\n\n       TIOCM_LE        DSR (data set ready/line enable)\n       TIOCM_DTR       DTR (data terminal ready)\n       TIOCM_RTS       RTS (request to send)\n       TIOCM_ST        TXD secundario (transmitir)\n       TIOCM_SR        RXD secundario (recibir)\n       TIOCM_CTS       CTS (clear to send)\n       TIOCM_CAR       DCD (data carrier detect)\n       TIOCM_CD         vea TIOCM_CAR\n       TIOCM_RNG       RNG (ring)\n       TIOCM_RI         vea TIOCM_RNG\n       TIOCM_DSR       DSR (data set ready)\n\n   Marcar una línea como local\n       TIOCGSOFTCAR   int *argp\n              (\"Get  software  carrier  flag\")  Obtiene  el  estado de la bandera CLOCAL del campo c_cflag de la\n              estructura termios.\n\n       TIOCSSOFTCAR   const int *argp\n              (\"Set software carrier flag\") Activa la bandera CLOCAL de la estructura termios  cuando  *argp  es\n              distinto de cero y la borra en caso contrario.\n\n       Si la bandera CLOCAL para una línea está apagada, la señal de detección de la portadora hardware (DCD) es\n       significativa y una operación open(2) sobre el tty correspondiente se bloqueará hasta que se produzca  el\n       aserto de DCD, a menos que se haya especificado la opción O_NONBLOCK.  Si CLOCAL está activa, la línea se\n       comporta como si DCD estuviera siempre activa. Normalmente,  la  bandera  de  la  portadora  software  se\n       enciende para los dispositivos locales y se apaga para las líneas con modems.\n\n   Específico de Linux\n       Para la ioctl TIOCLINUX vea console_ioctl(4).\n\n   Depuración del núcleo\n       #include <linux/tty.h>\n\n       TIOCTTYGSTRUCT struct tty_struct *argp\n              Obtiene la tty_struct correspondiente a fd.\n\nVALOR DEVUELTO\n       La  llamada al sistema ioctl() devuelve 0 en caso de éxito. En caso de error devuelve -1 y asigna a errno\n       un valor adecuado.\n\n", "ERRORES": "       ENOIOCTLCMD\n              Orden desconocida.\n\n       EINVAL Parámetro de orden inválido.\n\n       EPERM  Permiso insuficiente.\n\n       ENOTTY fd inapropiado.\n\n", "EJEMPLO": "       Comprueba el estado de la línea DTR del puerto serie.\n\n       #include <termios.h>\n       #include <fcntl.h>\n       #include <sys/ioctl.h>\n\n       main() {\n           int fd, serial;\n\n           fd = open(\"/dev/ttyS0\", O_RDONLY);\n           ioctl(fd, TIOCMGET, &serial);\n           if (serial & TIOCM_DTR)\n               puts(\"TIOCM_DTR está apagado\");\n           else\n               puts(\"TIOCM_DTR está encendido\");\n           close(fd);\n       }\n\nVÉASE TAMBIÉN\n       ioctl(2), termios(3), console_ioctl(4).\n\nLinux                                           29 diciembre 2002                                   TTY_IOCTL(4)\n"},{"NOMBRE": "       ttys - líneas serie de terminales\n\n", "DESCRIPCIÓN": "       ttyS[0-3] son los dispositivos de caracter para las líneas serie de terminales.\n\n       Normalmente se crean con:\n\n              mknod -m 660 /dev/ttyS0 c 4 64 # dir. base 0x03f8\n              mknod -m 660 /dev/ttyS1 c 4 65 # dir. base 0x02f8\n              mknod -m 660 /dev/ttyS2 c 4 66 # dir. base 0x03e8\n              mknod -m 660 /dev/ttyS3 c 4 67 # dir. base 0x02e8\n              chown root:tty /dev/ttyS[0-3]\n\n", "FICHEROS": "       /dev/ttyS[0-3]\n\nVÉASE TAMBIÉN\n       mknod(1), chown(1), getty(1), tty(4), setserial(8).\n\nLinux                                           19 diciembre 1992                                        TTYS(4)\n"},{"NOMBRE": "       random, urandom - dispositivos de la fuente de números aleatorios del núcleo\n\n", "DESCRIPCIÓN": "       Los  ficheros  especiales  de  caracteres /dev/random y /dev/urandom (presente desde la versión 1.3.30 de\n       Linux) proporcionan una interfaz con  el  generador  de  números  aleatorios  del  núcleo.   El  ficheros\n       /dev/random  tiene  1  como  número major de dispositivo y 8 como número menor de dispositivo. El fichero\n       /dev/urandom tiene 1 como número major de dispositivo y 9 como número menor de dispositivo.\n\n       El generador de números aleatorios recoge el ruido ambiental procedente de los manejadores de dispositivo\n       y otras fuentes y lo guarda en un \"almacen de entropía\". El generador también mantiene una estimación del\n       número de bits de ruído en el almacen de entropía. Los números aleatorios  se  crean  a  partir  de  este\n       almacen.\n\n       En  las lecturas, el dispositivo /dev/random sólo devolverá bytes aleatorios teniendo en cuenta el número\n       de bits de ruído en el almacen de entropía  (es  decir,  se  devolverán  los  bytes  solicitados  si  hay\n       suficientes bits en el almacen para formar dichos bytes). /dev/random debe ser adecuado en aquellos casos\n       en los que se necesite una aleatoriedad de gran calidad tales como \"one-time  pad\"  y  la  generación  de\n       claves.  Cuando el almacen de entropía está vacío, las lecturas sobre /dev/random se bloquearán hasta que\n       se recoga ruido ambiental adicional.\n\n       En las lecturas, el dispositivo /dev/urandom devolverá tantos bytes como se soliciten. Como resultado, si\n       no  hay suficiente entropía en el almacen de entropía, los valores devueltos son teóricamente vulnerables\n       a un ataque criptográfico sobre los algoritmos usados por el manejador. El  conocimiento  de  cómo  hacer\n       esto  no  está  disponible  en  la literatura \"sin clasificar\" actual pero teóricamente es posible que un\n       ataque así pueda existir. Si esto es una preocupación de su aplicación, use /dev/random en su lugar.\n\n", "CONFIGURACIÓN": "       Si en su sistema no existen todavía  /dev/random  y  /dev/urandom,  puede  crearlos  con  las  siguientes\n       órdenes:\n\n               mknod -m 644 /dev/random c 1 8\n               mknod -m 644 /dev/urandom c 1 9\n               chown root:root /dev/random /dev/urandom\n\n       Cuando  un sistema Linux arranca sin mucha interación del operador, el almacen de entropía puede estar en\n       un estado bastante predecible.  Esto reduce la cantidad actual de ruido en el  almacen  de  entropía  por\n       debajo  de lo recomendado. Para contrarestar este efecto, podemos conservar la información del almacen de\n       entropía entre las paradas y arranques del sistema. Para hacer esto, añada las  siguientes  líneas  a  un\n       guión shell adecuado que se ejecute durante la secuencia de arranque del sistema Linux:\n\n            echo \"Initializando el generador de números aleatorios del núcleo...\"\n            # Initializamos el generador de números aleatorios del núcleo\n            # de este arranque a partir de la semilla aleatoria de la última\n            # parada (o arranque). Cargamos y a continuación salvamos 512 bytes,\n            # que es el tamaño del almacen de entropía.\n            if [ -f /var/random-seed ]; then\n                 cat /var/random-seed >/dev/urandom\n            fi\n            dd if=/dev/urandom of=/var/random-seed count=1\n\n       También,  añada  las  siguientes  líneas  a un guión shell apropiado que se ejecute durante la parada del\n       sistema Linux:\n\n            # Mantenemos una semilla aleatoria entre una parada y un arranque\n            # para el generador de números aleatorios. Salvamos 512 bytes, que\n            # es el tamaño del almacen de entropía del generador de números\n            # aleatorios.\n            echo \"Salvando semilla aleatoria...\"\n            dd if=/dev/urandom of=/var/random-seed count=1\n\n", "FICHEROS": "       /dev/random\n       /dev/urandom\n\n", "AUTOR": "       El generador de números aleatorios del núcleo fue escrito por Theodore Ts'o (tytso@athena.mit.edu).\n\nVÉASE TAMBIÉN\n       mknod (1)\n       RFC 1750, \"Randomness Recommendations for Security\"\n\nLinux                                             1 Agosto 1997                                        RANDOM(4)\n"},{"NOMBRE": "       vcs, vcsa - memoria de la consola virtual\n\n", "DESCRIPCIÓN": "       /dev/vcs0  es un dispositivo de carácter con número mayor 7 y número menor 0, creado normalmente con modo\n       0644 y propietario root.tty. Designa la memoria del  terminal  de  consola  virtual  visualizado  en  ese\n       momento.\n\n       /dev/vcs[1-63]  son los dispositivos de carácter para los terminales de consola virtual. Tienen el número\n       mayor 7 y el número menor de 1 a 63, y se crean normalmente con el  modo  0644  y  propietario  root.tty.\n       /dev/vcsa[0-63]  son  lo  mismo, pero incluyendo los atributos, y prefijados con cuatro bytes que indican\n       las dimensiones de la pantalla y la posición del cursor: líneas, columnas, x, y (x = y = 0 en la  esquina\n       superior izquierda de la pantalla).\n\n       Estos  dispositivos  reemplazan  las  ioctls  de  volcado  de  pantalla  de  console(4),  de forma que el\n       administrador del sistema pueda controlar el acceso a través de los permisos del sistema de ficheros.\n\n       Los dispositivos de las ocho primeras consolas virtuales se pueden crear con:\n\n            for x in 0 1 2 3 4 5 6 7 8; do\n                 mknod -m 644 /dev/vcs$x c 7 $x;\n                 mknod -m 644 /dev/vcsa$x c 7 $[$x+128];\n            done\n            chown root:tty /dev/vcs*\n\n       No se aceptan peticiones de ioctl().\n\n", "EJEMPLOS": "       Se puede hacer un volcado de pantalla de vt3 conmutando a vt1 y tecleando cat /dev/vcs3 >foo. Nótese  que\n       la  salida  no  contiene  caracteres de nueva línea, por lo que puede ser necesario algo de procesamiento\n       adicional, como por ejemplo en fold  -w  81  /dev/vcs3  |  lpr  o  en  (horror)  setterm  -dump  3  -file\n       /proc/self/fd/1.\n\n       El dispositivo /dev/vcsa0 se utiliza para el soporte Braille.\n\n       El siguiente programa visualiza los atributos de carácter y pantalla que se encuentran en la posición del\n       cursor de la segunda consola virtual, y después cambia su color de fondo allí:\n\n            #include <unistd.h>\n            #include <stdlib.h>\n            #include <stdio.h>\n            #include <fcntl.h>\n\n            int main() {\n                 int fd;\n                 char *device = \"/dev/vcsa2\";\n                 struct {unsigned char lines, cols, x, y;} scrn;\n                 char ch, attrib;\n\n                 fd = open(device, O_RDWR);\n                 if (fd < 0) {\n                      perror(device);\n                      exit(1);\n                 }\n                 (void)read(fd, &scrn, 4);\n                 (void)lseek(fd, 4 + 2*(scrn.y*scrn.cols + scrn.x), 0);\n                 (void)read(fd, &ch, 1);\n                 (void)read(fd, &attrib, 1);\n                 printf(\"ch='%c' attrib=0x%02x\\n\", ch, attrib);\n                 attrib ^= 0x10;\n                 (void)lseek(fd, -1, 1);\n                 (void)write(fd, &attrib, 1);\n                 return 0;\n            }\n\n", "FICHEROS": "       /dev/vcs[0-63]\n       /dev/vcsa[0-63]\n\n", "AUTOR": "       Andries Brouwer <aeb@cwi.nl>\n\n", "HISTORIA": "       Disponible a partir de la versión 1.1.92 del núcleo de Linux.\n\nVÉASE TAMBIÉN\n       console(4), tty(4), ttys(4), selection(1)\n\nLinux                                             2 Julio 1996                                            VCS(4)\n"},{"NOMBRE": "       vcs, vcsa - memoria de la consola virtual\n\n", "DESCRIPCIÓN": "       /dev/vcs0  es un dispositivo de carácter con número mayor 7 y número menor 0, creado normalmente con modo\n       0644 y propietario root.tty. Designa la memoria del  terminal  de  consola  virtual  visualizado  en  ese\n       momento.\n\n       /dev/vcs[1-63]  son los dispositivos de carácter para los terminales de consola virtual. Tienen el número\n       mayor 7 y el número menor de 1 a 63, y se crean normalmente con el  modo  0644  y  propietario  root.tty.\n       /dev/vcsa[0-63]  son  lo  mismo, pero incluyendo los atributos, y prefijados con cuatro bytes que indican\n       las dimensiones de la pantalla y la posición del cursor: líneas, columnas, x, y (x = y = 0 en la  esquina\n       superior izquierda de la pantalla).\n\n       Estos  dispositivos  reemplazan  las  ioctls  de  volcado  de  pantalla  de  console(4),  de forma que el\n       administrador del sistema pueda controlar el acceso a través de los permisos del sistema de ficheros.\n\n       Los dispositivos de las ocho primeras consolas virtuales se pueden crear con:\n\n            for x in 0 1 2 3 4 5 6 7 8; do\n                 mknod -m 644 /dev/vcs$x c 7 $x;\n                 mknod -m 644 /dev/vcsa$x c 7 $[$x+128];\n            done\n            chown root:tty /dev/vcs*\n\n       No se aceptan peticiones de ioctl().\n\n", "EJEMPLOS": "       Se puede hacer un volcado de pantalla de vt3 conmutando a vt1 y tecleando cat /dev/vcs3 >foo. Nótese  que\n       la  salida  no  contiene  caracteres de nueva línea, por lo que puede ser necesario algo de procesamiento\n       adicional, como por ejemplo en fold  -w  81  /dev/vcs3  |  lpr  o  en  (horror)  setterm  -dump  3  -file\n       /proc/self/fd/1.\n\n       El dispositivo /dev/vcsa0 se utiliza para el soporte Braille.\n\n       El siguiente programa visualiza los atributos de carácter y pantalla que se encuentran en la posición del\n       cursor de la segunda consola virtual, y después cambia su color de fondo allí:\n\n            #include <unistd.h>\n            #include <stdlib.h>\n            #include <stdio.h>\n            #include <fcntl.h>\n\n            int main() {\n                 int fd;\n                 char *device = \"/dev/vcsa2\";\n                 struct {unsigned char lines, cols, x, y;} scrn;\n                 char ch, attrib;\n\n                 fd = open(device, O_RDWR);\n                 if (fd < 0) {\n                      perror(device);\n                      exit(1);\n                 }\n                 (void)read(fd, &scrn, 4);\n                 (void)lseek(fd, 4 + 2*(scrn.y*scrn.cols + scrn.x), 0);\n                 (void)read(fd, &ch, 1);\n                 (void)read(fd, &attrib, 1);\n                 printf(\"ch='%c' attrib=0x%02x\\n\", ch, attrib);\n                 attrib ^= 0x10;\n                 (void)lseek(fd, -1, 1);\n                 (void)write(fd, &attrib, 1);\n                 return 0;\n            }\n\n", "FICHEROS": "       /dev/vcs[0-63]\n       /dev/vcsa[0-63]\n\n", "AUTOR": "       Andries Brouwer <aeb@cwi.nl>\n\n", "HISTORIA": "       Disponible a partir de la versión 1.1.92 del núcleo de Linux.\n\nVÉASE TAMBIÉN\n       console(4), tty(4), ttys(4), selection(1)\n\nLinux                                             2 Julio 1996                                            VCS(4)\n"},{"NOMBRE": "       wavelan - controlador del dispositivo AT&T GIS WaveLAN ISA\n\n", "SINOPSIS": "       insmod wavelan_cs.o [io=B,B..] [ irq=I,I..] [name=N,N..]\n\n", "DESCRIPCIÓN": "       wavelan es el controlador de dispositivo de bajo nivel para el adaptador Ethernet inalámbrico WaveLAN ISA\n       de NCR / AT&T / Lucent y RoamAbout DS de Digital (DEC).  Este controlador está disponible como  módulo  o\n       puede compilarse en el núcleo. Este controlador admite varias tarjetas en ambas formas (hasta 4) y asigna\n       el siguiente controlador Ethernet disponible (eth0..eth#) para cada tarjeta que encuentra, a menos que se\n       especifique  explícitamente  un  nombre  de  dispositivo (vea más abajo). Este nombre de dispositivo será\n       registrado en el fichero de registro del núcleo con la dirección física (MAC), NWID y frecuencia empleada\n       por la tarjeta.\n\n", "PARÁMETROS": "       Esta  sección  se  aplica  al  módulo  (parámetros  pasados  en  la  línea de orden de insmod(8)).  Si el\n       controlador se incluye en el núcleo, emplee la sintaxis ether=IRQ,IO,NAME en  la  línea  de  órdenes  del\n       núcleo.\n\n       io     Especifica  la  lista de direcciones de base donde buscar tarjetas Wavelan (se establece por medio\n              de un interruptor en la tarjeta). Si  no  se  especifica  ninguna  dirección  io,  el  controlador\n              rastreará las direcciones 0x390 y 0x3E0, que pueden entrar en conflicto con otro hardware...\n\n       irq    Establece  la  lista de interrupciones (IRQ) que cada tarjeta Wavelan podría utilizar (el valor se\n              guarda en almacenamiento permanente para un uso futuro).\n\n       name   Establece la lista de nombres que serán empleados para cada dispositivo tarjeta  Wavelan  (nombres\n              empleados por ifconfig(8)).\n\nEXTENSIONES INALÁMBRICAS\n       Emplee iwconfig(8) para manipular extensiones inalámbricas.\n\n   NWID (o dominio)\n       Establece  la  ID  de  red  [0  a  FFFF]  o  la inhabilita [off].  Como el NWID se almacena en el Área de\n       Almacenamiento Permanente de la tarjeta, será reutilizado en cualquier llamada posterior del controlador.\n\n   Frecuencia y canales\n       Para el hardware 2.00 a 2,4 GHz, Ud. puede establecer la frecuencia especificando uno de los  10  canales\n       definidos  (2.412,  2.422,  2.425,  2.4305,  2.432, 2.442, 2.452, 2.460, 2.462 o 2.484) o directamente su\n       valor. La frecuencia se cambia inmediata y permanentemente. La disponibilidad de la frecuencia depende de\n       los reglamentos y regulaciones...\n\n   Estadísticas de espía\n       Establece una lista de direcciones Ethernet (MAC) en el dispositivo (hasta 8) y obtiene la última calidad\n       de enlace para cada una de ellas (vea iwspy(8)).\n\n   /proc/net/wireless\n       status es el estado según informa el módem.  Calidad de enlace informa de la calidad de la modulación  en\n       el  aire  (espectro  extendido  de  secuencia directa) [max = 16].  Level y Noise se refieren al nivel de\n       señal y nivel de ruido [max = 64 ].  Los contadores crypt discarded packet y  misc  discarded  packet  no\n       están implementados.\n\nIOCTL PRIVADO\n       Ud. puede utilizar iwpriv(8) para manipular ioctls privadas.\n\n   Umbral de Calidad y Nivel\n       Le permite definir el umbral de calidad y nivel empleado por el módem (un paquete por debajo de ese nivel\n       es descartado).\n\n   Histograma\n       Esta funcionalidad permite establecer un número de intervalos de nivel de señal y  contar  el  número  de\n       paquetes  recibidos  en  cada  uno de estos intervalos definidos. Esta distribución podría emplearse para\n       calcular el valor medio y la desviación estándar del nivel de señal.\n\nOBSERVACIONES ESPECÍFICAS\n       Este controlador fallará en la detección de algunas tarjetas Wavelan no de NCR/ATT&T/Lucent.  Si éste  es\n       su caso, Ud. debe mirar en el código fuente cómo añadir su tarjeta en la rutina de detección.\n\n       Algunas  de  las  características  mencionadas  son  opcionales.  Ud. puede habilitarlas o inhabilitarlas\n       cambiando constantes en el fichero de cabecera del controlador y recompilando.\n\n", "AUTOR": "       Bruce Janson - bruce@cs.usyd.edu.au\n       Jean Tourrilhes - jt@hplb.hpl.hp.com\n       (+ otros - vea el código fuente para más detalles)\n\nVÉASE TAMBIÉN\n       wavelan_cs(4), ifconfig(8), insmod(8), iwconfig(8), iwspy(8), iwpriv(8)\n\nUniv. de Sydney (Dpto. CC. C. Basser)                22/X/96                                          WAVELAN(4)\n"},{"NOMBRE": "       null, zero - sumidero de datos\n\n", "DESCRIPCIÓN": "       Los datos escritos en los ficheros especiales null o zero se desechan.\n\n       La lectura del fichero especial null siempre devuelve \"fin de fichero (EOF)\", mientras que la lectura del\n       fichero zero siempre devuelve el caracteres \\0 (NULL).\n\n       null y zero se crean normalmente con:\n\n              mknod -m 666 /dev/null c 1 3\n              mknod -m 666 /dev/zero c 1 5\n              chown root:mem /dev/null /dev/zero\n\n", "OBSERVACIONES": "       Si estos dos ficheros no tienen permiso de lectura y escritura para todos los usuarios, muchos  programas\n       se comportarán de manera extraña.\n\n", "FICHEROS": "       /dev/null\n       /dev/zero\n\nVÉASE TAMBIÉN\n       mknod(1), chown(1)\n\nLinux                                             30 Junio 1996                                          NULL(4)\n"}]