[{"NOMBRE": "       banner - imprime un título grande en la impresora\n\n", "SINOPSIS": "       /usr/games/banner [ -wn ] mensaje ...\n\n", "DESCRIPCIÓN": "       Banner  imprime  un  título  grande  y  de  gran  calidad en la salida estandar.  Si se omite el mensaje,\n       pregunta por él, y lee una línea de su entrada estandar. Si -w se incluye, la salida se achata desde  una\n       anchura de 132 a n , conveniente para una terminal más estrecha. Si n se omite, su valor por defecto será\n       80.\n\n       La salida debería ser impresa en un dispositivo de copia física, de hasta  132  columnas  de  ancho,  sin\n       caracteres  de  interrupción  de  página.  El  volumen es lo suficientemente grande para que se desee una\n       impresora o una terminal rápida de copia fisica , pero si se es paciente, una decwriter u  otra  terminal\n       de 300 baudios puede hacerlo.\n\n", "BUGS": "       Agunos  caracteres  ASCII no están definidos, destacando <, >, [, ], \\, ^, _, {, }, |, y ~.  También, los\n       caracteres \", ', y & tienen un aspecto divertido (pero util.)\n\n       La opción -w se implementa saltando algunas filas y columnas.  Cuanto más  pequeño  se  haga,  más  grano\n       tendrá la salida.  Algunas veces mezcla las letras.\n\n", "AUTOR": "       Mark Horton\n\n3rd Berkeley Distribution                         6 Junio 1993                                         BANNER(6)\n"},{"NOMBRE": "       intro - Introducción a órdenes de usuario\n\n", "DESCRIPCIÓN": "       Este capítulo describe órdenes de usuario.\n\n", "AUTORES": "       Busque  en  la cabecera de cada página del Manual el autor o autores y las condiciones sobre los derechos\n       de copia. ¡Observe que éstos pueden ser diferentes de una página a otra!\n\nLinux                                          24 de Julio de 1993                                      INTRO(1)\n"}]